#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 dpasswd (8) >>  dpasswd  (8)   ( Русские man: Команды системного администрирования ) 
 
   
 НАЗВАНИЕ 

 dpasswd  - изменяет dialup пароль
 
   
 СИНТАКСИС 

 dpasswd  [ - ( a | d )]  _шел_ 
 
   
 ОПИСАНИЕ 

 
 dpasswd  добавляет, удаляет и изменяет, dialup пароли для
пользовательских login шелов. dialup пароль предлогается
ввести пользователю для иденьификации всякий раз кода
пользователь заходит в систему по dialup линии.  dpasswd 
требует ввести дважды новый пароль , для того чтобы
удостоверится что пароль введен верно.
 
Аргумент  shell  должен быть программой для входа в ситему
(login programm)с полным путем. program.
 
   
 ФАЙЛЫ 

/etc/d_passwd
/etc/dialups
 
   
 СМ. ТАКЖЕ 

 login (1) 
 
   
 Перевод 

Copyrihgt(C) by Kosta Kudrin
 cola@tcsb.perm.su 
2:5054/ 69@fidonet 
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ФАЙЛЫ 
 СМ. ТАКЖЕ 
 Перевод 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename