#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 iptables-restore (8) >>  iptables-restore  (8)   ( Русские man: Команды системного администрирования )   iptables-restore  (8)   ( Linux man: Команды системного администрирования ) 


   
 ИМЯ 

iptables-restore - восстановить таблицы IP
   
 ОБЗОР 

 iptables-restore  [-c] [-n]

 

   
 ОПИСАНИЕ 

 

 iptables-restore 

используется для восстановления IP таблиц на основе данных из стандартного
ввода. Чтобы считать информацию из файла, используйте предоставляемое командной
оболочкой перенаправление ввода/вывода.
 
 -c ,  --counters 
восстановить значения для всех счетчиков байтов и пакетов.
 -n ,  --noflush   
не удалять предыдущее содержимое таблицы. Если этот флаг не указан, 
 iptables-restore 

сбрасывает (удаляет) все предыдущее содержимое соответствующих таблиц IP.
 
   
 ОШИБКИ 

Ни одна не известна для iptables-1.2.1.
   
 АВТОР 

Гаральд Уэльт (Harald Welte) < laforge@gnumonks.org >
   
 СМ. ТАКЖЕ 

 iptables-save (8),  iptables (8) 

 

iptables-HOWTO, где детально описано использование iptables, NAT-HOWTO,
где детализирован NAT, и netfilter-hacking-HOWTO где детально описано
внутреннее строение iptables.
   
 ПЕРЕВОД 

Перевод с английского Виктор Ерёмин < ErV2005@rambler.ru > 2007

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 ОШИБКИ 
 АВТОР 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename