#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 load_policy (8) >>  load_policy  (8)   ( Русские man: Команды системного администрирования )   load_policy  (8)   ( Linux man: Команды системного администрирования ) 
   
 НАЗВАНИЕ 

load_policy - Загрузить новую политику SELinux в ядро
 
   
 СИНТАКСИС 

 load_policy  

[-bq]
 

   
 ОПИСАНИЕ 

 

load_policy - утилита, использующаяся для загрузки/замены политики в ядре.
По умолчанию при загрузке политики load_policy сохраняет текущие значения
переключателей
   
 ОПЦИИ 

 
 -b 

 
сбросить переключатели в значения, определенные в политике.
 -q 

 
скрыть предупреждения.
 
 
   
 СМОТРИ ТАКЖЕ 

 booleans 

(8),
   
 АВТОРЫ 

 Эту страницу руководства написал Dan Walsh < dwalsh@redhat.com >.
Перевод руководства - Андрей Маркелов < andrey@markelov.net >, 2007г.
Программа написана Stephen Smalley < sds@epoch.ncsc.mil >.

 
 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ОПЦИИ 
 СМОТРИ ТАКЖЕ 
 АВТОРЫ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename