#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 rpm2cpio (8)   rpm2cpio  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня ) >>  rpm2cpio  (8)   ( Русские man: Команды системного администрирования )   rpm2cpio  (8)   ( Linux man: Команды системного администрирования ) 
   
 НАЗВАНИЕ 

rpm2cpio -  Извлекает архив cpio из RPM пакета
   
 ОБЗОР 

 rpm2cpio  [имя файла] 
   
 ОПИСАНИЕ 

 rpm2cpio  конвертирует файл .rpm, заданный как его единственный аргумент,
в архив cpio на стандартном выводе. Если в качестве аргумента указано '-', 
RPM пакет считывается со стандартного ввода.
 
 

 rpm2cpio rpm-1.1-1.i386.rpm 

 

 rpm2cpio - < glint-1.0-1.i386.rpm 

 
   
 СМОТРИ ТАКЖЕ 

 rpm (8)

   
 АВТОР 

 Erik Troan < ewt@redhat.com >
 

   
 ПЕРЕВОД 

 Андрей Мартынов < andrewm@inventa.ru >
 

 

 
   Index 
 
 НАЗВАНИЕ 
 ОБЗОР 
 ОПИСАНИЕ 
 СМОТРИ ТАКЖЕ 
 АВТОР 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename