#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 smbumount (8) >>  smbumount  (8)   ( Русские man: Команды системного администрирования )   smbumount  (8)   ( Linux man: Команды системного администрирования ) 
   
 ИМЯ 

smbumount - umount для обычных пользователей
   
 ОБЗОР 

 smbumount 

 каталог_монтирования 

 
   
 ОПИСАНИЕ 

С помощью этой программы, обычные пользователи могут размонтировать
файловую систему smb, посредством предоставления прав суперпользователя
(root) на эту операцию.
 
 smbumount 

была написана для того, чтобы дать обчным пользователям linux больше
возможностей для управления своими ресурсами. Установка идентификатора
суперпользователя на выполнение этой программы безопасно, так как 
произвести размонтирование сможет только тот пользователь, который
ранее смонтировал этот ресурс.
 
Пользователю root нет необходимости пользоваться smbumount. Вместо
этого он может использовать обычную программу umount.
 
   
 ОПЦИИ 

 каталог_монтирования 

 
 каталог_монтирования 

это каталог, в который вы хотите размонтировать.
 
 
   
 СМОТРИТЕ ТАКЖЕ 

 smbmount (8) 

 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 ОПЦИИ 
 СМОТРИТЕ ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename