#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 bzero (3)   bzero  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  bzero  (3)   ( Русские man: Библиотечные вызовы )   bzero  (3)   ( Linux man: Библиотечные вызовы )   bzero  (3)   ( POSIX man: Библиотечные вызовы )   bzero  (9)   ( Solaris man: Ядро ) 
   
 НАЗВАНИЕ 

bzero - записывает пустые байты
   
 СИНТАКСИС 

 #include < strings.h > 

 I void bzero(void * s , size_t  n ); 
 

   
 ОПИСАНИЕ 

Функция
 bzero()                               

устанавливает первые
 n  

байтов области, начинающейся с
 s  

в нули (пустые байты).
   
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 

Нет возвращаемых значений.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

4.3BSD.  Эта функция устарела, поэтому замените ее функцией
 memset 

в новых программах.
   
 СМ. ТАКЖЕ 

 memset (3),

 swab (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename