#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 cproj (3)   cproj  (3)   ( Solaris man: Библиотечные вызовы ) >>  cproj  (3)   ( Русские man: Библиотечные вызовы )   cproj  (3)   ( Linux man: Библиотечные вызовы )   cproj  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

cproj, cprojf, cprojl - проекция на римановскую сферу
   
 СИНТАКСИС 

 #include < complex.h > 

 
 double complex cproj(double complex  z ); 

 
 float complex cprojf(float complex  z ); 

 
 long double complex cprojl(long double complex  z ); 

 
   
 ОПИСАНИЕ 

С помощью этой функции вы можете проецировать точку плоскости на поверхность
римановской сферы, одноточечную компактификацию комплексной плоскости.
Каждая конечная точка z проецируется в саму z.
Все комплексные бесконечные значения проецируются в одно бесконечное значение,
а именно в положительную бесконечность действительной оси. 
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

C99
   
 СМ. ТАКЖЕ 

 cabs (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename