#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 ffs (3)   ffs  (3)   ( Solaris man: Библиотечные вызовы )   ffs  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  ffs  (3)   ( Русские man: Библиотечные вызовы )   ffs  (3)   ( Linux man: Библиотечные вызовы )   ffs  (3)   ( POSIX man: Библиотечные вызовы )   ffs  (7)   ( FreeBSD man: Макропакеты и соглашения ) 
   
 НАЗВАНИЕ 

ffs - ищет первый единичный бит в слове
   
 СИНТАКСИС 

 #include < strings.h > 

 int ffs(int  i ); 
 

   
 ОПИСАНИЕ 

Фукнция  ffs()  возвращает позицию первого единичного бита
в слове  i .  Наименьший бит находится в позиции номер 1,
а наибольший - в позиции номер 32 или 64.
   
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 

Функция  ffs()  возвращает позицию первого единичного бита
или NULL, если все биты нулевые.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

+BSD 4.3, POSIX 1003.1-2001.
   
 ЗАМЕЧАНИЯ 

В системах BSD прототип находится в
 < string.h > .

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 ЗАМЕЧАНИЯ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename