#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 gammal (3) >>  gammal  (3)   ( Русские man: Библиотечные вызовы )   gammal  (3)   ( Linux man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

gamma - логарифм гамма-функции
   
 СИНТАКСИС 

 #include < math.h > 

 
 double gamma (double  x ); 

 
 float gammaf (float  x ); 

 
 long double gammal (long double  x ); 

 
   
 ОПИСАНИЕ 

Функция
 gamma() 

существует для совместимости. Она эквивалентна
 lgamma(). 

Используйте ее. Использование названия
 gamma() 

очень смущает, так как эта функция не вычисляет собственно гамма-функцию,
а натуральный логарифм гамма-функции.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

Нестандартно. Совместимо с предыдущими ошибками.
   
 СМ. ТАКЖЕ 

 lgamma (3),

 signgam (3),

 tgamma (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename