#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 isatty (3)   isatty  (3)   ( Solaris man: Библиотечные вызовы )   isatty  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  isatty  (3)   ( Русские man: Библиотечные вызовы )   isatty  (3)   ( Linux man: Библиотечные вызовы )   isatty  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

isatty - определяет, ссылается ли данный описатель на терминал
   
 СИНТАКСИС 


 #include < unistd.h > 

 int isatty(int  desc ); 
 


   
 ОПИСАНИЕ 

Возвращает 1, если  desc  является открытым описателем,
соединенным с терминалом, в противном случае возвращает 0.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

SVID, AT&T, X/OPEN, BSD 4.3
   
 СМ. ТАКЖЕ 

 fstat (2),

 ttyname (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename