#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 memcmp (3)   memcmp  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  memcmp  (3)   ( Русские man: Библиотечные вызовы )   memcmp  (3)   ( Linux man: Библиотечные вызовы )   memcmp  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

memcmp - сравнивает области памяти
   
 СИНТАКСИС 

 #include < string.h > 

 int memcmp(const void * s1 , const void * s2 , size_t  n ); 
 

   
 ОПИСАНИЕ 

Функция  memcmp()  сравнивает первые  n  байтов областей памяти
 s1  и  s2 .  Возвращается целое число, меньшее,
большее нуля или равное ему, если определено, что  s1 
меньше, больше, чем  s2 , или равно ему.
   
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 

Функция  memcmp()  возвращает целое, меньшее,
большее нуля или равное ему, если определено, что первые  n  байтов  s1  
меньше, больше, чем первые  n  байтов  s2 , или равны им.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

SVID 3, BSD 4.3, ISO 9899 (C99)
   
 СМ. ТАКЖЕ 

 bcmp (3),

 strcasecmp (3),

 strcmp (3),

 strcoll (3),

 strncmp (3),

 strncasecmp (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename