#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 issue.net (5) >>  issue.net  (5)   ( Русские man: Форматы файлов )   issue.net  (5)   ( Linux man: Форматы файлов ) 
 
   
 НАЗВАНИЕ 

issue.net - идентификационный файлд для telnet сессий
 
   
 ОПИСАНИЕ 

Файл  /etc/issue  это текстовый файл , который содержит
сообщение или идентификационную информацию о системе
,которая будет выведена перед приглашением входа в систему
при telnet сесси . Этот файл может содержать различные
последовательности  %символов  Следующие последовательности
поддерживаютсмя  telnetd :
 
 
 %t   
 
     - показывает текущий (терминал) tty
 
 %h   
 
     - Показывает полное имя системы (FQDN)
 
 %D   
 
     - Показывает имя NIS домена
 
 %d   
 
     - показывает текущее время и дату
 
 %s   
 
     - показывает имя опреационной системы
 
 %m   
 
     - показывает тип машины (hardware)
 
 %r   
 
     - показывает релиз операционной системы
 
 %v   
 
     - показывает версию операционной системы
 
 %%   
 
     - показывает один символ `%'
 
 
   
 ФАЙЛЫ 

/etc/issue.net
 
   
 СМ. ТАКЖЕ 

 telnetd (8) 
 
   
 Перевод 

Copyright (C) by Kosta Kudrin
 cola@tcsb.perm.su 
2:5054/ 69@fidonet 
 
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 ФАЙЛЫ 
 СМ. ТАКЖЕ 
 Перевод 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename