#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 iso_8859_7 (7) >>  iso_8859_7  (7)   ( Русские man: Макропакеты и соглашения )   iso_8859_7  (7)   ( Linux man: Макропакеты и соглашения ) 

   
 НАЗВАНИЕ 

iso_8859-7 - набор символов, закодированных в восьмеричной,
десятичной и шестнадцатеричной системах исчисления согласно стандарту ISO 8859-7
   
 ОПИСАНИЕ 

Стандарт ISO 8859 включает в себя несколько 8-битных расширений для
набора символов ASCII (также известного как ISO 646-IRV). ISO 8859-7 включает в себя 
символы, используемые в современном греческом языке.
   
 Алфавиты ISO 8859 

Полный список алфавитов ISO 8859 включает в себя:

 
 ISO 8859-1 Западноевропейские языки (Latin-1) 
 ISO 8859-2 Восточноевропейские языки (Latin-2) 
 ISO 8859-3 Языки юго-восточной Европы и другие (Latin-3) 
 ISO 8859-4 Скандинавские/балтийские языки (Latin-4) 
 ISO 8859-5 Кириллицу (Latin/Cyrillic) 
 ISO 8859-6 Арабский (Latin/Arabic) 
 ISO 8859-7 Греческий (Latin/Greek) 
 ISO 8859-8 Иврит (Latin/Hebrew) 
 ISO 8859-9 Модификацию Latin-1 турецкого языка (Latin-5) 
 ISO 8859-10 Саамский/скандинавский/эскимосский (Latin-6) 
 ISO 8859-11 Тайский 
 ISO 8859-13 Прибалтийские языки (Latin-7) 
 ISO 8859-14 Кельтский (Latin-8) 
 ISO 8859-15 Западноевропейские языки (Latin-9) 
 ISO 8859-16    Восточноевропейские языки (Latin-10) 
 

   
 Символы ISO 8859-7 

Нижеописанная таблица содержит символы стандарта ISO 8859 Latin-7, которые
можно вывести на печать и которые не перечислены на странице руководства 
 ascii (7).

Четвертая колонка показывает соответствующие глифы только в окружении,
настроенном для ISO 8859-7.
 
 Восьм.  Десят. Шестн. Символ Название   
 240 160 A0   НЕПЕРЕНОСИМЫЙ ПРОБЕЛ                                      
 241 161 A1   ЗНАК ПЕРЕВЕРНУТОЙ ЗАПЯТОЙ ПРИ БУКВЕ                       
 242 162 A2   АПОСТРОФ ПРИ БУКВЕ                                        
 243 163 A3 ё ЗНАК ФУНТА                                                
 246 166 A6   РАЗОРВАННАЯ ВЕРТИКАЛЬНАЯ ЧЕРТА                            
 247 167 A7   ЗНАК ПАРАГРАФА                                            
 250 168 A8   ДИЭРЕЗА                                                   
 251 169 A9   ЗНАК КОПИРАЙТА                                            
 253 171 AB   ЛЕВЫЕ КАВЫЧКИ                                             
 254 172 AC   ЗНАК НЕ                                                   
 255 173 AD   "МЯГКИЙ" ДЕФИС                                              
 257 175 AF   ГОРИЗОНТАЛЬНАЯ ЧЕРТА                                      
 260 176 B0   ЗНАК ГРАДУСА                                              
 261 177 B1   ЗНАК ПЛЮС-МИНУС                                           
 262 178 B2   2 В ВЕРХНЕМ РЕГИСТРЕ                                      
 263 179 B3 Ё 3 В ВЕРХНЕМ РЕГИСТРЕ                                      
 264 180 B4   ГРЕЧЕСКИЙ ТОНОС                                           
 265 181 B5   ГРЕЧЕСКИЕ ДИАЛИТИКА И ТОНОС                               
 266 182 B6   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "АЛЬФА" С ТОНОСОМ                 
 267 183 B7   ТОЧКА ПОСЕРЕДИНЕ                                          
 270 184 B8   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЭПСИЛОН" С ТОНОСОМ  
 271 185 B9   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЭТА" С ТОНОСОМ  
 272 186 BA   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА" С ТОНОСОМ  
 273 187 BB   ПРАВЫЕ КАВЫЧКИ                                            
 274 188 BC   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ОМИКРОН" С ТОНОСОМ               
 275 189 BD   ОДНА ВТОРАЯ                                               
 276 190 BE   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН" С ТОНОСОМ               
 277 191 BF   ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ОМЕГА" С ТОНОСОМ                 
 300 192 C0 ю СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА" С ДИАЛИТИКОЙ И ТОНОСОМ      
 301 193 C1 а ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "АЛЬФА"                           
 302 194 C2 б ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "БЕТА"                           
 303 195 C3 ц ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ГАММА"                           
 304 196 C4 д ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ДЕЛЬТА"                          
 305 197 C5 е ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЭПСИЛОН"                         
 306 198 C6 ф ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ДЗЕТА"                           
 307 199 C7 г ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЭТА"                             
 310 200 C8 х ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ТЕТА"                            
 311 201 C9 и ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА"                            
 312 202 CA й ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "КАППА"                           
 313 203 CB к ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЛЯМБДА"                          
 314 204 CC л ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "МЮ"                              
 315 205 CD м ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "НЮ"                              
 316 206 CE н ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "КСИ"                             
 317 207 CF о ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ОМИКРОН"                         
 320 208 D0 п ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ПИ"                              
 321 209 D1 я ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "РО"                              
 323 211 D3 с ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "СИГМА"                           
 324 212 D4 т ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ТАУ"                             
 325 213 D5 у ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН"                         
 326 214 D6 ж ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ФИ"                              
 327 215 D7 в ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ХИ"                              
 330 216 D8 ь ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ПСИ"                             
 331 217 D9 ы ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ОМЕГА"                           
 332 218 DA з ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА" С ДИАЛИТИКОЙ               
 333 219 DB ш ЗАГЛАВНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН" С ДИАЛИТИКОЙ            
 334 220 DC э СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "АЛЬФА" С ТОНОСОМ                  
 335 221 DD щ СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЭПСИЛОН" С ТОНОСОМ                
 336 222 DE ч СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЭТА" С ТОНОСОМ                    
 337 223 DF ъ СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА" С ТОНОСОМ                   
 340 224 E0 Ю СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН" С ДИАЛИТИКОЙ             
 341 225 E1 А СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "АЛЬФА"                            
 342 226 E2 Б СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "БЕТА"                             
 343 227 E3 Ц СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ГАММА"                            
 344 228 E4 Д СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ДЕЛЬТА"                           
 345 229 E5 Е СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЭПСИЛОН"                          
 346 230 E6 Ф СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ДЗЕТА"                            
 347 231 E7 Г СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЭТА"                              
 350 232 E8 Х СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ТЕТА"                             
 351 233 E9 И СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА"                             
 352 234 EA Й СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "КАППА"                            
 353 235 EB К СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЛЯБДА"                            
 354 236 EC Л СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "МЮ"                               
 355 237 ED М СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "НЮ"                               
 356 238 EE Н СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "КСИ"                              
 357 239 EF О СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ОМИКРОН"                          
 360 240 F0 П СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ПИ"                               
 361 241 F1 Я СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "РО"                               
 362 242 F2 Р СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "СИГМА"                            
 363 243 F3 С СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "СИГМА"                            
 364 244 F4 Т СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ТАУ"                              
 365 245 F5 У СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН"                          
 366 246 F6 Ж СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ПИ"                               
 367 247 F7 В СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ХИ"                               
 370 248 F8 Ь СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ПСИ"                              
 371 249 F9 Ы СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ОМЕГА"                            
 372 250 FA З СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ЙОТА" С ДИАЛИТИКОЙ                
 373 251 FB Ш СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН" С ДИАЛИТИКОЙ             
 374 252 FC Э СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ОМИКРОН" С ТОНОСОМ                
 375 253 FD Щ СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ИПСИЛОН" С ТОНОСОМ                
 376 254 FE Ч СТРОЧНАЯ ГРЕЧЕСКАЯ БУКВА "ОМЕГА" С ТОНОСОМ                  
 ISO 8859-7 ранее была известна как ELOT-928 или ECMA-118:1986.   
                                             
   
   
   
 


 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 
 Алфавиты ISO 8859 
 Символы ISO 8859-7 
 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename