#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 ldp (7) >>  ldp  (7)   ( Русские man: Макропакеты и соглашения ) 
   
 ИМЯ 

LDP - Введение в Проект Документации Linux (Linux Documentation Project),
помощь, руководства и документы
   
 ОБЗОР 

Проект Документации Linux (сокращеное английское название LDP)
предоставляет сообществу Linux разные виды свободных и бесплатных
ресурсов документации, включая руководства, FAQ (список часто
задаваемых вопросов), HOWTO и страницы руководства man.
 
   
 АВТОРЫ 

Различные документы в архивах LDP сопровождаются отдельными авторами,
которые указываются в начале каждого документа HOWTO. Если у вас есть
какие-либо вопросы или дополнения к документу, мы призываем вас
напрямую связаться с авторами.
 
   
 WEB-СТРАНИЦЫ 

LDP имеет свой собтвенный web-сайт и поддерживает множество разных
проектов переводов, которые связаны с главным web-сайтом LDP, адрес
которого
 
 http://www.tldp.org/ 
 

вы, возможно, захотите добавить к своим загладкам.
 
   
 СТРАНИЦЫ РУКОВОДСТВА MAN 

Существует web-страница с информацией о состоянии и переводах
страниц руководства man по адресу
 
 http://www.win.tue.nl/~aeb/linux/man/ 
 

 
   
 СПИСКИ РАССЫЛКИ 

LDP имеет несколько списков рассылки, таких как
 


 
 
 
 < announce@en.tlpd.org > 
Анонсы проекта LDP
 < discuss@en.tldp.org > 
Общая дискуссия по проекту LDP
 < docbook@en.tldp.org > 
Вопросы об использовании DocBook
 
 

Информацию о том, как подписаться на эти списки рассылки, смотрите на
указаннм выше сайте.
 

Если вы интересуетесь как написать ваш документ для проекта LDP с
помощью DocBook, то, верояно, вы захотите также подписаться на один
из списков рассылки OASIS DocBook. Информацию о том как это сделать,
смотрите по адресу
 http://docbook.org/mailinglist/index.html .
 
   
 ФАЙЛЫ 

Большинство дистрибутивов включают в установку документы HOWTO и mini-HOWTO

 
 /usr/doc/                    (старое место для документации) 
 /usr/share/doc/              (новое место для документации) 
 /usr/share/doc/HOWTO/        (файлы HOWTO) 
 /usr/share/doc/HOWTO/mini/   (файлы mini-HOWTO) 

 
   
 СМОТРИ ТАКЖЕ 

 man (1),

 xman (1x),

 info (1)

 

страницы  info , которые можно прочитать с помощью
 emacs (1)

или
 info (1)

   
 ПЕРЕВОД 

Перевёл с английского Виктор Вислобоков < corochoone@perm.ru > 2005
 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 АВТОРЫ 
 WEB-СТРАНИЦЫ 
 СТРАНИЦЫ РУКОВОДСТВА MAN 
 СПИСКИ РАССЫЛКИ 
 ФАЙЛЫ 
 СМОТРИ ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename