#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 iso_8859-16 (7) >>  iso_8859-16  (7)   ( Русские man: Макропакеты и соглашения )   iso_8859-16  (7)   ( Linux man: Макропакеты и соглашения ) 

   
 НАЗВАНИЕ 

iso_8859-16 - набор символов, закодированных в восьмеричной,
десятичной и шестнадцатеричной системах исчисления согласно стандарту ISO 8859-16
   
 ОПИСАНИЕ 

Стандарт ISO 8859 включает в себя несколько 8-битных расширений для
набора символов ASCII (также известного как ISO 646-IRV).
Вариант ISO 8859-16 стандарта ISO 8859-1, "латинский алфавит N10"
используется для кодирования латинских символов центральной и восточной
Европы и обычно не реализуется производителями программ.

Стандарт ISO 8859-16 поддерживает следующие языки: албанский, боснийский,
хорватский, английский, финский, немецкий, венгерский, ирладский,
польский, румынский, словацкий и сербский.

Также учтите, что следующие кириллические языки транслитерируются
один в один на Latin 10: македонский и сербский.
   
 Алфавиты ISO 8859 

Полный список алфавитов ISO 8859 включает в себя:

 
 ISO 8859-1 Западноевропейские языки (Latin-1) 
 ISO 8859-2 Восточноевропейские языки (Latin-2) 
 ISO 8859-3 Языки юго-восточной Европы и другие (Latin-3) 
 ISO 8859-4 Скандинавские/балтийские языки (Latin-4) 
 ISO 8859-5 Кириллицу (Latin/Cyrillic) 
 ISO 8859-6 Арабский (Latin/Arabic) 
 ISO 8859-7 Греческий (Latin/Greek) 
 ISO 8859-8 Иврит (Latin/Hebrew) 
 ISO 8859-9 Модификацию Latin-1 турецкого языка (Latin-5) 
 ISO 8859-10 Саамский/скандинавский/эскимосский (Latin-6) 
 ISO 8859-11 Тайский 
 ISO 8859-13 Прибалтийские языки (Latin-7) 
 ISO 8859-14 Кельтский (Latin-8) 
 ISO 8859-15 Западноевропейские языки (Latin-9) 
 ISO 8859-16 Румынский (Latin-10) 
 

   
 Символы ISO 8859-16 

Нижеописанная таблица содержит символы стандарта ISO 8859 Latin-10, которые
можно вывести на печать и которые не перечислены на странице руководства
 ascii (7).

Четвертая колонка показывает соответствующие глифы только в окружении,
настроенном для ISO 8859-16.
 
 
 Восьм. Десят. Шестн. Символ Название 
 
 240 160 A0 ═ НЕПЕРЕНОСИМЫЙ ПРОБЕЛ 
 241 161 A1 ║ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С "БОРОДКОЙ" 
 242 162 A2 ╒ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С "БОРОДКОЙ" 
 243 163 A3 ё ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА L С ЧЕРТОЙ 
 244 164 A4 ╓ ЗНАК ЕВРО 
 245 165 A5 ╔ ДВОЙНЫЕ НИЖНИЕ-9 КАВЫЧКИ 
 246 166 A6 ╕ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА S С "КОРОНОЙ" 
 247 167 A7 ╖ ЗНАК ПАРАГРАФА 
 250 168 A8 ╗ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S С "КОРОНОЙ" 
 251 169 A9 ╘ ЗНАК КОПИРАЙТА 
 252 170 AA ╙ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА S С НИЖНЕЙ ЗАПЯТОЙ 
 253 171 AB ╚ ЛЕВЫЕ ДВОЙНЫЕ УГЛОВЫЕ КАВЫЧКИ 
 254 172 AC ╛ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Z С "ОСТРЫМ" УДАРЕНИЕМ 
 255 173 AD ╜ "МЯГКИЙ" ДЕФИС 
 256 174 AE ╝ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Z С "ОСТРЫМ" УДАРЕНИЕМ 
 257 175 AF ╞ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Z С ТОЧКОЙ НАВЕРХУ 
 260 176 B0 ╟ ЗНАК ГРАДУСА 
 261 177 B1 ╠ ЗНАК ПЛЮС-МИНУС 
 262 178 B2 ╡ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА C С "КОРОНОЙ" 
 263 179 B3 Ё СТРОЧНАЯ ЛАТИНСКАЯ БУКВА L С ЧЕРТОЙ 
 264 180 B4 ╢ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Z С "КОРОНОЙ" 
 265 181 B5 ╣ ЛЕВЫЕ ДВОЙНЫЕ КАВЫЧКИ 
 266 182 B6 ╤ ЗНАК АБЗАЦА 
 267 183 B7 ╥ ТОЧКА ПОСЕРЕДИНЕ 
 270 184 B8 ╦ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Z С "КОРОНОЙ" 
 271 185 B9 ╧ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА C С "КОРОНОЙ" 
 272 186 BA ╨ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S С ЗАПЯТОЙ ВНИЗУ 
 273 187 BB ╩ ПРАВЫЕ ДВОЙНЫЕ УГЛОВЫЕ КАВЫЧКИ 
 274 188 BC ╪ ЗАГЛАВНАЯ ЛАТИНСКАЯ ЛИГАТУРА OE 
 275 189 BD ╫ СТРОЧНАЯ ЛАТИНСКАЯ ЛИГАТУРА OE 
 276 190 BE ╬ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Y С ДИЭРЕЗОЙ 
 277 191 BF © СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Z С ТОЧКОЙ НАВЕРХУ 
 300 192 C0 ю ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С "ТУПЫМ" УДАРЕНИЕМ 
 301 193 C1 а ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С "ОСТРЫМ" УДАРЕНИЕМ 
 302 194 C2 б ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 303 195 C3 ц ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A СО ЗНАКОМ КРАТКОСТИ 
 304 196 C4 д ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С ДИЭРЕЗОЙ 
 305 197 C5 е ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА C С "ОСТРЫМ" УДАРЕНИЕМ 
 306 198 C6 ф ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА AE 
 307 199 C7 г ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА C С СЕДИЛЬЮ 
 310 200 C8 х ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С "ТУПЫМ" УДАРЕНИЕМ 
 311 201 C9 и ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С "ОСТРЫМ" УДАРЕНИЕМ 
 312 202 CA й ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 313 203 CB к ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С ДИЭРЕЗОЙ 
 314 204 CC л ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА I С "ТУПЫМ" УДАРЕНИЕМ 
 315 205 CD м ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА I С "ОСТРЫМ" УДАРЕНИЕМ 
 316 206 CE н ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА I С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 317 207 CF о ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА I С ДИЭРЕЗОЙ 
 320 208 D0 п ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА D С ЧЕРТОЙ 
 321 209 D1 я ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА N С "ОСТРЫМ" УДАРЕНИЕМ 
 322 210 D2 р ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С "ТУПЫМ" УДАРЕНИЕМ 
 323 211 D3 с ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С "ОСТРЫМ" УДАРЕНИЕМ 
 324 212 D4 т ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 325 213 D5 у ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ 
 326 214 D6 ж ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С ДИЭРЕЗОЙ 
 327 215 D7 в ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА S С "ОСТРЫМ" УДАРЕНИЕМ 
 330 216 D8 ь ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ 
 331 217 D9 ы ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С "ТУПЫМ" УДАРЕНИЕМ 
 332 218 DA з ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С "ОСТРЫМ" УДАРЕНИЕМ 
 333 219 DB ш ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 334 220 DC э ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С ДИЭРЕЗОЙ 
 335 221 DD щ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С "БОРОДКОЙ" 
 336 222 DE ч ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА T С ЗАПЯТОЙ ВНИЗУ 
 337 223 DF ъ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА ОСТРАЯ S 
 340 224 E0 Ю СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С "ТУПЫМ" УДАРЕНИЕМ 
 341 225 E1 А СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С "ОСТРЫМ" УДАРЕНИЕМ 
 342 226 E2 Б СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 343 227 E3 Ц СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A СО ЗНАКОМ КРАТКОСТИ 
 344 228 E4 Д СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С ДИЭРЕЗОЙ 
 345 229 E5 Е СТРОЧНАЯ ЛАТИНСКАЯ БУКВА C С "ОСТРЫМ" УДАРЕНИЕМ 
 346 230 E6 Ф СТРОЧНАЯ ЛАТИНСКАЯ БУКВА AE 
 347 231 E7 Г СТРОЧНАЯ ЛАТИНСКАЯ БУКВА C С СЕДИЛЬЮ 
 350 232 E8 Х СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С "ТУПЫМ" УДАРЕНИЕМ 
 351 233 E9 И СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С "ОСТРЫМ" УДАРЕНИЕМ 
 352 234 EA Й СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 353 235 EB К СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С ДИЭРЕЗОЙ 
 354 236 EC Л СТРОЧНАЯ ЛАТИНСКАЯ БУКВА I С "ТУПЫМ" УДАРЕНИЕМ 
 355 237 ED М СТРОЧНАЯ ЛАТИНСКАЯ БУКВА I С "ОСТРЫМ" УДАРЕНИЕМ 
 356 238 EE Н СТРОЧНАЯ ЛАТИНСКАЯ БУКВА I С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 357 239 EF О СТРОЧНАЯ ЛАТИНСКАЯ БУКВА I С ДИЭРЕЗОЙ 
 360 240 F0 П СТРОЧНАЯ ЛАТИНСКАЯ БУКВА D С ЧЕРТОЙ 
 361 241 F1 Я СТРОЧНАЯ ЛАТИНСКАЯ БУКВА N С "ОСТРЫМ" УДАРЕНИЕМ 
 362 242 F2 Р СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С "ТУПЫМ" УДАРЕНИЕМ 
 363 243 F3 С СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С "ОСТРЫМ" УДАРЕНИЕМ 
 364 244 F4 Т СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 365 245 F5 У СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ 
 366 246 F6 Ж СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С ДИЭРЕЗОЙ 
 367 247 F7 В СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S С "ОСТРЫМ" УДАРЕНИЕМ 
 370 248 F8 Ь СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ 
 371 249 F9 Ы СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С "ТУПЫМ" УДАРЕНИЕМ 
 372 250 FA З СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С "ОСТРЫМ" УДАРЕНИЕМ 
 373 251 FB Ш СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С ДИАКРИТИЧЕСКИМ ЗНАКОМ 
 374 252 FC Э СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С ДИЭРЕЗОЙ 
 375 253 FD Щ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С "БОРОДКОЙ" 
 376 254 FE Ч СТРОЧНАЯ ЛАТИНСКАЯ БУКВА T С ЗАПЯТОЙ ВНИЗУ 
 377 255 FF Ъ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Y С ДИЭРЕЗОЙ 
 

   
 СМ. ТАКЖЕ 

 ascii (7),

 iso_8859_1 (7)

 iso_8859_2 (7)

 iso_8859_15 (7)


Дополнительная информация:
 ISO 8859-16 (Latin 10) Resources 

( http://bucovina.chem.tue.nl/fonturi/index-en.html). 
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 
 Алфавиты ISO 8859 
 Символы ISO 8859-16 
 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename