#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 latin2 (7) >>  latin2  (7)   ( Русские man: Макропакеты и соглашения )   latin2  (7)   ( Linux man: Макропакеты и соглашения ) 

   
 НАЗВАНИЕ 

iso_8859-2 - набор символов, закодированных в восьмеричной,
десятичной и шестнадцатеричной системах исчисления согласно стандарту ISO 8859-1
   
 ОПИСАНИЕ 

Стандарт ISO 8859 включает в себя несколько 8-битных расширений для
набора символов ASCII (так же известного как ISO 646-IRV).  ISO 8859-2, "Latin Alphabet No. 2",
используется для кодирования символов центрально- и восточноевропейских языков 
и поэтому поддерживается некоторыми производителями программ.

Стандарт ISO 8859-2 поддерживает следующие языки: албанский, боснийский,
хорватский, чешский, английский, финский, немецкий, венгерский, ирландский, польский,
словацкий, словенский и сербский.

Заметьте, что некоторые языки на основе кириллицы имеют прямые транслитерации в Latin 2: 
македонский и сербский.

   
 Алфавиты ISO 8859 

Полный список алфавитов ISO 8859 включает в себя:

 
 ISO 8859-1 Западноевропейские языки (Latin-1) 
 ISO 8859-2 Восточноевропейские языки (Latin-2) 
 ISO 8859-3 Языки юго-восточной Европы и другие (Latin-3) 
 ISO 8859-4 Скандинавские/балтийские языки (Latin-4) 
 ISO 8859-5 Кириллицу (Latin/Cyrillic) 
 ISO 8859-6 Арабский (Latin/Arabic) 
 ISO 8859-7 Греческий (Latin/Greek) 
 ISO 8859-8 Иврит (Latin/Hebrew) 
 ISO 8859-9 Модификацию Latin-1 турецкого языка (Latin-5) 
 ISO 8859-10 Саамский/скандинавский/эскимосский (Latin-6) 
 ISO 8859-11 Тайский 
 ISO 8859-13 Прибалтийские языки (Latin-7) 
 ISO 8859-14 Кельтский (Latin-8) 
 ISO 8859-15 Западноевропейские языки (Latin-9) 
 ISO 8859-16     Румынский (Latin-10) 
 

   
 Символы ISO 8859-2 

Нижеописанная таблица содержит символы стандарта ISO 8859-2 (Latin-2), которые
можно вывести на печать и которые не перечислены на странице руководства 
 ascii (7).

Четвертая колонка показывает соответствующие глифы только в окружении,
настроенном для ISO 8859-2.
 
 Восьм.  Десят. Шестн. Символ Название   
 
 240 160 A0   НЕПЕРЕНОСИМЫЙ ПРОБЕЛ                                  
 241 161 A1   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С "БОРОДКОЙ"  
 242 162 A2   ЗНАК КРАТКОСТИ                                        
 243 163 A3 ё ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА L С ЧЕРТОЙ  
 244 164 A4   ЗНАК ВАЛЮТЫ                                           
 245 165 A5   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА L С "КОРОНОЙ"  
 246 166 A6   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА S С "ОСТРЫМ" УДАРЕНИЕМ  
 247 167 A7   ЗНАК ПАРАГРАФА                                        
 250 168 A8   ДИЭРЕЗА                                               
 251 169 A9   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА S С "КОРОНОЙ"  
 252 170 AA   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА S С СЕДИЛЬЮ  
 253 171 AB   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА T С "КОРОНОЙ"  
 254 172 AC   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Z С "ОСТРЫМ" УДАРЕНИЕМ  
 255 173 AD ╜[shc] "МЯГКИЙ" ДЕФИС                                          
 256 174 AE   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Z С "КОРОНОЙ"  
 257 175 AF   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Z С ТОЧКОЙ СВЕРХУ  
 260 176 B0   ЗНАК ГРАДУСА                                          
 261 177 B1   ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С "БОРОДКОЙ"  
 262 178 B2   "БОРОДКА"  
 263 179 B3 Ё СТРОЧНАЯ ЛАТИНСКАЯ БУКВА L С ЧЕРТОЙ  
 264 180 B4   СИЛЬНЫЙ АКЦЕНТ                                        
 265 181 B5   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА L С "КОРОНОЙ"  
 266 182 B6   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S С "ОСТРЫМ" УДАРЕНИЕМ  
 267 183 B7   "КОРОНА"  
 270 184 B8   СЕДИЛЬ                                                
 271 185 B9   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S С "КОРОНОЙ"  
 272 186 BA   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S СЕДИЛЬЮ  
 273 187 BB   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА T С "КОРОНОЙ"  
 274 188 BC   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Z С "ОСТРЫМ" УДАРЕНИЕМ  
 275 189 BD   ЗНАК ДВОЙНОГО "ОСТРОГО" УДАРЕНИЯ                        
 276 190 BE   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Z С "КОРОНОЙ"  
 277 191 BF   СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Z С ТОЧКОЙ СВЕРХУ  
 300 192 C0 ю ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА R С "ОСТРЫМ" УДАРЕНИЕМ  
 301 193 C1 а ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С "ОСТРЫМ" УДАРЕНИЕМ  
 302 194 C2 б ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С ДИАКРИТИЧЕСКИМ ЗНАКОМ  
 303 195 C3 ц ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A СО ЗНАКОМ КРАТКОСТИ  
 304 196 C4 д ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА A С ДИЭРЕЗОЙ                
 305 197 C5 е ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА L С "ОСТРЫМ" УДАРЕНИЕМ  
 306 198 C6 ф ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА C С "ОСТРЫМ" УДАРЕНИЕМ  
 307 199 C7 г ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА C СЕДИЛЬЮ                   
 310 200 C8 х ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА C С "КОРОНОЙ"  
 311 201 C9 и ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Е С "ОСТРЫМ" УДАРЕНИЕМ        
 312 202 CA й ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С "БОРОДКОЙ"  
 313 203 CB к ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С ДИЭРЕЗОЙ                
 314 204 CC л ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА E С "КОРОНОЙ"  
 315 205 CD м ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА I С "ОСТРЫМ" УДАРЕНИЕМ        
 316 206 CE н ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА I С ДИАКРИТИЧЕСКИМ ЗНАКОМ   
 317 207 CF о ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА D С "КОРОНОЙ"  
 320 208 D0 п ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА D С ЧЕРТОЙ  
 321 209 D1 я ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА N С "ОСТРЫМ" УДАРЕНИЕМ  
 322 210 D2 р ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА N С "КОРОНОЙ"  
 323 211 D3 с ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА О С "ОСТРЫМ" УДАРЕНИЕМ        
 324 212 D4 т ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С ДИАКРИТИЧЕСКИМ ЗНАКОМ   
 325 213 D5 у ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ  
 326 214 D6 ж ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА O С ДИЭРЕЗОЙ                
 327 215 D7 в ЗНАК УМНОЖЕНИЯ                                        
 330 216 D8 ь ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА R С "КОРОНОЙ"  
 331 217 D9 ы ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С КОЛЬЦОМ СВЕРХУ  
 332 218 DA з ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С "ОСТРЫМ" УДАРЕНИЕМ        
 333 219 DB ш ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ  
 334 220 DC э ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА U С ДИЭРЕЗОЙ                
 335 221 DD щ ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА Y С "ОСТРЫМ" УДАРЕНИЕМ        
 336 222 DE ч ЗАГЛАВНАЯ ЛАТИНСКАЯ БУКВА T С СЕДИЛЬЮ  
 337 223 DF ъ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА S ("ЖЕСТКАЯ")                   
 340 224 E0 Ю СТРОЧНАЯ ЛАТИНСКАЯ БУКВА R С "ОСТРЫМ" УДАРЕНИЕМ  
 341 225 E1 А СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С "ОСТРЫМ" УДАРЕНИЕМ        
 342 226 E2 Б СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С ДИАКРИТИЧЕСКИМ ЗНАКОМ   
 343 227 E3 Ц СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С "БОРОДКОЙ"                
 344 228 E4 Д СТРОЧНАЯ ЛАТИНСКАЯ БУКВА A С ДИЭРЕЗОЙ                
 345 229 E5 Е СТРОЧНАЯ ЛАТИНСКАЯ БУКВА L С "ОСТРЫМ" УДАРЕНИЕМ  
 346 230 E6 Ф СТРОЧНАЯ ЛАТИНСКАЯ БУКВА C С "ОСТРЫМ" УДАРЕНИЕМ  
 347 231 E7 Г СТРОЧНАЯ ЛАТИНСКАЯ БУКВА C СЕДИЛЬЮ                   
 350 232 E8 Х СТРОЧНАЯ ЛАТИНСКАЯ БУКВА C С "КОРОНОЙ"  
 351 233 E9 И СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Е С "ОСТРЫМ" УДАРЕНИЕМ        
 352 234 EA Й СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С "БОРОДКОЙ"  
 353 235 EB К СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С ДИЭРЕЗОЙ                
 354 236 EC Л СТРОЧНАЯ ЛАТИНСКАЯ БУКВА E С "КОРОНОЙ"  
 355 237 ED М СТРОЧНАЯ ЛАТИНСКАЯ БУКВА I С "ОСТРЫМ" УДАРЕНИЕМ        
 356 238 EE Н СТРОЧНАЯ ЛАТИНСКАЯ БУКВА I С ДИАКРИТИЧЕСКИМ ЗНАКОМ   
 357 239 EF О СТРОЧНАЯ ЛАТИНСКАЯ БУКВА D С "КОРОНОЙ"  
 360 240 F0 П СТРОЧНАЯ ЛАТИНСКАЯ БУКВА D С ЧЕРТОЙ  
 361 241 F1 Я СТРОЧНАЯ ЛАТИНСКАЯ БУКВА N С "ОСТРЫМ" УДАРЕНИЕМ  
 362 242 F2 Р СТРОЧНАЯ ЛАТИНСКАЯ БУКВА N С "КОРОНОЙ"  
 363 243 F3 С СТРОЧНАЯ ЛАТИНСКАЯ БУКВА О С "ОСТРЫМ" УДАРЕНИЕМ        
 364 244 F4 Т СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С ДИАКРИТИЧЕСКИМ ЗНАКОМ   
 365 245 F5 У СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ  
 366 246 F6 Ж СТРОЧНАЯ ЛАТИНСКАЯ БУКВА O С ДИЭРЕЗОЙ                
 367 247 F7 В ЗНАК ДЕЛЕНИЯ                                          
 370 248 F8 Ь СТРОЧНАЯ ЛАТИНСКАЯ БУКВА R С "КОРОНОЙ"  
 371 249 F9 Ы СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С КОЛЬЦОМ СВЕРХУ  
 372 250 FA З СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С "ОСТРЫМ" УДАРЕНИЕМ        
 373 251 FB Ш СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С ДВОЙНЫМ "ОСТРЫМ" УДАРЕНИЕМ  
 374 252 FC Э СТРОЧНАЯ ЛАТИНСКАЯ БУКВА U С ДИЭРЕЗОЙ                
 375 253 FD Щ СТРОЧНАЯ ЛАТИНСКАЯ БУКВА Y С "ОСТРЫМ" УДАРЕНИЕМ        
 376 254 FE Ч СТРОЧНАЯ ЛАТИНСКАЯ БУКВА T С СЕДИЛЬЮ  
 377 255 FF Ъ ТОЧКА СВЕРХУ  
 

   
 СМ. ТАКЖЕ 

 ascii (7),

 iso_8859_1 (7),

 iso_8859_16 (7)


Дополнительная информация:
 ISO 8859-2 (Latin 2) Resources 

( http://sizif.mf.uni-lj.si/linux/cee/iso8859-2.html). 
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 
 Алфавиты ISO 8859 
 Символы ISO 8859-2 
 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename