#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 translators (7) >>  translators  (7)   ( Русские man: Макропакеты и соглашения ) 
   
 НАЗВАНИЕ 

translators - страница руководства, содержащая информацию об авторских правах
   
 ОПИСАНИЕ 

Данное руководство переведено подразделением компании ASPLinux, соответственно,
все авторские права принадлежат компании ASPLinux. Руководство является переводом
пакета man-pages. Оно может распространяться и копироваться в соответствии с 
лицензией LDP GENERAL PUBLIC LICENSE (версия сентября 1998). 
Ответственности за последствия, к которым приведет использование содержания этого руководства, 
компания ASPLinux не несет.
   
 ПЕРЕВОДЧИКИ 

В переводе участвовали (в алфавитном порядке):
Григорий Бакунов < black@asplinux.ru >,
Денис Дементьев < denm@asplinux.ru >,
Александр Ермолаев < ave@asplinux.ru >,
Михаил Корепанов < kmic@asplinux.ru >,
Станислав Рогин < sam@asplinux.ru >.
Михаил Яхонтов < mvy@asplinux.ru >,
Редакция:
Наталья Томских < nata@asplinux.ru >
и все те же переводчики.
   
 КОНТАКТНЫЙ АДРЕС 

Все предложения и замечания отправляйте по адресу < man-pages@asplinux.ru >. На этот же адрес
вы можете прислать все ваши предложения о сотрудничестве, а также переведенную документацию,
которая отсутствует в дистрибутиве ASPLinux.
   
 БЛАГОДАРНОСТИ 

Особая благодарность выражается коллективу переводчиков, 
чьими материалами мы частично пользовались:
Alexey V. Medvedev, 2:5022/78.6
Алексей Миллер < asm@asm.kiev.ua >
Антон Аюпов < astray@yandex.ru >
Anton Lykov < last@last.ulsu.ru >
Виктор Вислобоков < victor_v@permonline.ru >
Дмитрий Морожников < dm@simplex.irkutsk.ru >, 2:5070/141.3
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 ПЕРЕВОДЧИКИ 
 КОНТАКТНЫЙ АДРЕС 
 БЛАГОДАРНОСТИ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename