#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 div (3)   div  (3)   ( Solaris man: Библиотечные вызовы )   div  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  div  (3)   ( Русские man: Библиотечные вызовы )   div  (3)   ( Linux man: Библиотечные вызовы )   div  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

div - вычисляет частное и остаток деления на целое число
   
 СИНТАКСИС 

 #include < stdlib.h > 

 div_t div(int  numer , int  denom ); 
 

   
 ОПИСАНИЕ 

Функция  div()  вычисляет величину  numer / denom  и
возвращает структуру  div_t , которая содержит
два целых числа с именами  quot  и  rem :
частное и остаток деления соответственно.
   
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 

Структура  div_t .
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

SVID 3, BSD 4.3, ISO 9899
   
 СМ. ТАКЖЕ 

 ldiv (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename