#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 fabsf (3)   fabsf  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  fabsf  (3)   ( Русские man: Библиотечные вызовы )   fabsf  (3)   ( Linux man: Библиотечные вызовы )   fabsf  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

fabs, fabsf, fabsl - абсолютное значение числа с плавающей точкой
   
 СИНТАКСИС 

 #include < math.h > 

 double fabs(double  x ); 
 
 float fabsf(float  x ); 
 
 long double fabsl(long double  x ); 
 

   
 ОПИСАНИЕ 

Функции  fabs()  возвращают абсолютное значение числа с плавающей точкой  x .
   
 НАЙДЕННЫЕ ОШИБКИ 

Не может произойти никаких ошибок.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

Фукнция
 fabs() 

соответсвует стандарту SVID 3, POSIX, BSD 4.3, ISO 9899.
Остальные функции соответствуют стандарту C99.
   
 СМ. ТАКЖЕ 

 abs (3),

 ceil (3),

 floor (3),

 labs (3),

 rint (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 НАЙДЕННЫЕ ОШИБКИ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename