#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 intro (3)   intro  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   intro  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня )   intro  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   intro  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   intro  (2)   ( Solaris man: Системные вызовы )   intro  (2)   ( FreeBSD man: Системные вызовы )   intro  (2)   ( Русские man: Системные вызовы )   intro  (2)   ( Linux man: Системные вызовы )   intro  (3)   ( Solaris man: Библиотечные вызовы )   intro  (3)   ( FreeBSD man: Библиотечные вызовы ) >>  intro  (3)   ( Русские man: Библиотечные вызовы )   intro  (3)   ( Linux man: Библиотечные вызовы )   intro  (4)   ( Solaris man: Специальные файлы /dev/* )   intro  (4)   ( FreeBSD man: Специальные файлы /dev/* )   intro  (4)   ( Русские man: Специальные файлы /dev/* )   intro  (4)   ( Linux man: Специальные файлы /dev/* )   intro  (5)   ( Solaris man: Форматы файлов )   intro  (5)   ( FreeBSD man: Форматы файлов )   intro  (5)   ( Русские man: Форматы файлов )   intro  (5)   ( Linux man: Форматы файлов )   intro  (6)   ( Solaris man: Игры )   intro  (6)   ( Русские man: Игры )   intro  (6)   ( Linux man: Игры )   intro  (7)   ( Solaris man: Макропакеты и соглашения )   intro  (7)   ( FreeBSD man: Макропакеты и соглашения )   intro  (7)   ( Русские man: Макропакеты и соглашения )   intro  (7)   ( Linux man: Макропакеты и соглашения )   intro  (8)   ( FreeBSD man: Команды системного администрирования )   intro  (8)   ( Русские man: Команды системного администрирования )   intro  (8)   ( Linux man: Команды системного администрирования )   intro  (9)   ( FreeBSD man: Ядро )   intro  (9)   ( Linux man: Ядро ) 
   
 НАЗВАНИЕ 

intro - предисловие к описаниям библиотечных функций
   
 ОПИСАНИЕ 

Эта глава описывает все библиотечные фукнции, исключая те,
что уже описаны в главе #2 о системных вызовах.
Существует несколько разных типов групп, они различаются
по букве, которая добавляется к номеру главы.
 
 (3C) 
Эти функции, функции из главы #2 и главы #3S содержатся в
стандартной библиотеке libc языка C, которая используется
 cc (1)

по умолчанию.
 (3S) 
Данные функции являются частью библиотеки
 stdio (3).

Они содержатся в стандартной библиотеке libc языка C.
 (3M) 
Эти функции содержатся в арифметической библиотеке libm.
Они используются компилятором
 f77 (1)

языка FORTRAN по умолчанию, но не компилятором
 cc (1)

языка C, который требует наличия параметра  -lm .
 (3F) 
Данные функции являются частью библиотеки libF77 языка FORTRAN.
Для использования этих функций не нужно
никаких специальных параметров компилятора.
 (3X) 
Различные специальные библиотеки. Страницы помощи, описывающие их функции, 
определяются по названиям библиотек.
 
   
 АВТОРЫ 

Список авторов, авторских прав и условия распространения информации можно 
найти в заголовке каждой конкретной страницы руководства. Обратите внимание, 
что они могут отличаться от странице к странице!
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 АВТОРЫ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename