#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 strfry (3) >>  strfry  (3)   ( Русские man: Библиотечные вызовы )   strfry  (3)   ( Linux man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

strfry - создание анаграммы строки
   
 СИНТАКСИС 

 #include < string.h > 

 char *strfry(char * string ); 
 

   
 ОПИСАНИЕ 

Функция  strfry()  изменяет порядок расположения элементов
(символов) в строке  string  при помощи  rand (3). В результате
получается анаграмма строки  string .
   
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 

Функция  strfry()  возвращает указатель на строку-анаграмму,
получившуюся в результате.
   
 СООТВЕТСТВИЕ СТАНДАРТАМ 

Функция  strfry()  есть только в бибилиотеке C для Linux
и в библиотеке C для GNU.
   
 СМ. ТАКЖЕ 

 memfrob (3)

 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ 
 СООТВЕТСТВИЕ СТАНДАРТАМ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename