#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 apropos (1)   apropos  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   apropos  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  apropos  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   apropos  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня ) 

   
 ИМЯ 

apropos - ищет строки в базе данных whatis
   
 СИНТАКСИС 

 apropos 

СЛОВО ...
   
 ОПИСАНИЕ 

apropos показывает краткое описание команд, содержащих СЛОВО.
   
 СМ. ТАКЖЕ 

 whatis (1),  man (1).
 
   
 ПЕРЕВОД 

Перевод с английского Всеволод Хализев < vkhalizev@gmail.com > 2007

 
   Index 
 
 ИМЯ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename