#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 bootparamd (1) >>  bootparamd  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   bootparamd  (8)   ( FreeBSD man: Команды системного администрирования )   bootparamd  (8)   ( Linux man: Команды системного администрирования ) 
 
 
 bootparamd(1M) 
 bootparamd(1M) 
 
 

 НАЗВАНИЕ 
 bootparamd  - сервер параметров загрузки 

 СИНТАКСИС 
 
	/usr/lib/nfs/bootparamd [-d]
 
 ОПИСАНИЕ 
 Команда  bootparamd  представляет собой серверный процесс, предоставляющий 
информацию, необходимую для загрузки бездисковых клиентов. Он получает 
информацию из файла  /etc/bootparams . 

       Файлы 
 /etc/bootparams 
 
 

 ИСПОЛЬЗОВАНИЕ 
 Демон  bootparamd  автоматически вызывается на  уровне выполнения  3. 

 Опция  -d  выдает отладочную информацию. 

 Только привилегированный пользователь может выполнять эту команду. 

 ССЫЛКИ 
 
	 bootparams(4) ,
	 inetd(1M) ,
	 nfsping(1M) 
 

 Copyright 1994 Novell, Inc. 
Copyright 1999  В. Кравчук ,
 OpenXS Initiative , перевод на русский язык
 

 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename