#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 clear (1)   clear  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   clear  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  clear  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   clear  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   clear  (3)   ( Solaris man: Библиотечные вызовы )   clear  (3)   ( FreeBSD man: Библиотечные вызовы )   clear  (3)   ( Linux man: Библиотечные вызовы ) Ключ  clear  обнаружен в базе ключевых слов. 

   
 НАЗВАНИЕ 

 clear  - очищает экран терминала
   
 СИНТАКСИС 

 clear 
 

   
 ОПИСАНИЕ 

 clear  очищает ваш экран, если это возможно. Команда ищет в переменных
окружения и в базе данных  terminfo  тип вашего терминала для определения
метода очистки экрана.
   
 СМ. ТАКЖЕ 

 tput (1),  terminfo (5)



 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename