#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 FvwmSave (1)   FvwmSave  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня ) >>  FvwmSave  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
 
   
 НАЗВАНИЕ 

 
FvwmSave - модуль FVWM, записывающий расположение окон на
виртуальном рабочем столе
 
   
 СИНТАКСИС 

 
FvwmSave вызывается оконным менеджером fvwm и не будет работать при вызове
его из конмадной строки.
 
   
 ОПИСАНИЕ 

 
При вызове, этот модуль пытается записать расположение
окон на текущем десктопе в файл с именем new.xinitrc.
Было бы идеально, если бы расположение сохранялось в файле .xinitrc, но
в реальной жизни Вам будет необходимо отредактировать его
под свои нужды, так что делайте резервную копию вашего
старого .xinitrc.
 
Ваши приложения должны снабжать систему X Window
определенными советами. Emacs, например, не делает этого,
так что FvwmSave не может взять какую-либо информацию от
него.
 
Также, FvwmSave предполагает, что представленные в
командной строке опции являются глобально доступными для
приложений, что может быть неверно.
 
   
 ПРАВА 

 
Программа NoClutter и концепция интерфейса этого модуля
менеджером окон являются оригинальной работой Robert
Nation.
 
Copyright 1994, Robert Nation. Без каких либо явных или
неявных гарантий. Используйте эту программу на свой страх
и риск. Даются права на использование этой программы в
любых целях при сохранении этой секции об авторских
правах.
 
   
 АВТОР(Ы) 

 
Robert Nation и Mr. Per Persson < pp@solace.mh.se >
(Omnion on IRC)
 
   
 Перевод 

 
Перевел с английского Виктор Вислобоков.
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ПРАВА 
 АВТОР(Ы) 
 Перевод 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename