#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 iconv (1)   iconv  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня ) >>  iconv  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   iconv  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   iconv  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   iconv  (3)   ( Solaris man: Библиотечные вызовы )   iconv  (3)   ( Русские man: Библиотечные вызовы )   iconv  (3)   ( Linux man: Библиотечные вызовы )   iconv  (3)   ( POSIX man: Библиотечные вызовы )   iconv  (5)   ( Solaris man: Форматы файлов ) Ключ  iconv  обнаружен в базе ключевых слов. 


   
 НАЗВАНИЕ 

iconv - преобразует кодировку указанных файлов
   
 СИНТАКСИС 

iconv  -f   encoding   -t   encoding   inputfile 
   
 ОПИСАНИЕ 

Программа  iconv  изменяет кодировку символов файла
 inputfile  . Результат выводится на стандартное устройство 
вывода, если не определен файл вывода параметром  --output  .
 

 --from-code ,  -f   encoding 
 

Преобразование из кодировки  encoding 
 

 --to-code ,  -t   encoding 
 

Преобразование в кодировку  encoding 
 

 --list 
 

Выдать список известных кодировок
 

 --output ,  -o   file 
 

Определить файл вывода (вместо stdout)
 

 --verbose 
 

Выдавать информацию о прогрессе.
   
 АВТОРЫ 

iconv создано Ulrich Drepper как часть библиотеки GNU C.
 

Это руководство создано Joel Klecker < espy@debian.org >
для системы Debian GNU/Linux.
 

 
 
 
 
 
 
 
 
 
 
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 АВТОРЫ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename