#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 imlate (1) >>  imlate  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    imlate ¶ 


	 НАЗВАНИЕ ¶ 


imlate - выводит предложения ключевых слов на основании заданной архитектуры. 

	 СИНТАКСИС ¶ 


	 imlate [опции] 


	 ОПЦИИ ¶ 


	 --version 


	 Вывести номер версии программы и выйти. 


	 -h, --help 


	 Показать эту справку и выйти. 


	 -f ФАЙЛ, --file=ФАЙЛ 


	 Записать результат в ФАЙЛ [по умолчанию будет использован стандартный вывод]. 


	 -m АРХИТЕКТУРА, --main=АРХИТЕКТУРА 


	 Установить основную АРХИТЕКТУРу (например, архитектуру вашей системы) [по умолчанию - amd64]. 


	 -t АРХИТЕКТУРА, --target=АРХИТЕКТУРА 


	 Выставить адресуемую архитектуру (например, x86) [значение по умолчанию - x86]. 


	 --mtime=ВРЕМЯ 


	 Установить минимальное значение ВРЕМени изменений, в днях [значение по умолчанию - 30] 


	 -s, --stable 


	 Выводить предложения для стабильных пакетов (например, стандартным результатом будут -s и -k) [значение по умолчанию - True (истинно)]. 


	 -k, --keyword 


	 Выводить предложения по ключевому слову (например, стандартным результатом будут -s и -k)  [значение по умолчанию - True (истинно)]. 


	 -M МЕЙНТЕЙНЕР, --maintainer=МЕЙНТЕЙНЕР 


	 Выводить только пакеты от указанного мейнтейнера. 


	 -H ГРУППА, --herd=ГРУППА 


	 Выводить только пакеты от указанной группы сопровождения. 


	 -C КАТЕГОРИИ, --category=КАТЕГОРИИ, --categories=КАТЕГОРИИ 


	 Включить в поиск указанную категорию/категории (через запятую) [по умолчанию - none (нет)]. 


	 АВТОРЫ ¶ 


	 
	 Christian Ruppert < idl0r@gentoo.org > 
	 


	 ОШИБКИ ¶ 


	 Об обнаруженных ошибках сообщайте на  http://bugs.gentoo.org 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 1.0.0 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename