#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 locale (1)   locale  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   locale  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  locale  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   locale  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   locale  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   locale  (3)   ( Linux man: Библиотечные вызовы )   locale  (5)   ( Solaris man: Форматы файлов )   locale  (5)   ( Русские man: Форматы файлов )   locale  (5)   ( Linux man: Форматы файлов )   locale  (7)   ( Русские man: Макропакеты и соглашения )   locale  (7)   ( Linux man: Макропакеты и соглашения ) Ключ  locale  обнаружен в базе ключевых слов. 


   
 НАЗВАНИЕ 

locale - считывает информацию о локали.
   
 СИНТАКСИС 

 locale   [   -a  |  -m ] 
 

 locale   [  -ck  ]   name ...
   
 ОПИСАНИЕ 

Программа  locale  выдает информацию о текущем окружении локали,
(или о всех локалях) на стандартное устройство вывода.
 

При запуске без параметров  locale  обобщает текущее 
окружение локали для всех категорий, определённых
переменными окружения LC_*.
 

 -a ,  --all-locales 
 



         Вывести названия доступных локалей.


 


 -m ,  --charmaps 
 



         Вывести названия доступных таблиц преобразований символов.


 


   
 ФОРМАТ ВЫВОДА 

 -c ,  --category-name 
 



         Выводить названия указанных категорий.


 


 -k ,  --keyword-name 
 



         Выводить названия и значения указанных ключевых слов.


 


   
 ПЕРЕМЕННЫЕ ОКРУЖЕНИЯ 

LC_CTYPE
 



         Классификация символов и преобразований регистра.


 


LC_COLLATE
 



         Порядок сравнения.


 


LC_TIME
 



         Форматы даты и времени.


 


LC_NUMERIC
 



         Числовые (не денежные) форматы.


 


LC_MONETARY
 



         Денежные форматы.


 


LC_MESSAGES

 



 
 Форматы информационных и отладочных сообщений и интерактивные ответы. 

 
   
 АВТОРЫ 

 locale  создано Ulrich Drepper для библиотеки GNU C.
 

Это руководство написано Joel Klecker < espy@debian.org >
для системы Debian GNU/Linux.
 

 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ФОРМАТ ВЫВОДА 
 ПЕРЕМЕННЫЕ ОКРУЖЕНИЯ 
 АВТОРЫ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename