#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 logname (1)   logname  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   logname  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  logname  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   logname  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   logname  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

logname - выводит имя пользователя, вызвавшего эту команду
   
 СИНТАКСИС 

 logname 

[ OPTION ]
   
 ОПИСАНИЕ 


 

Выводит имя текущего пользователя. Для нахождения имени используется файл
 /var/run/utmp .

Если в этом файле отсутствует элемент для вызвавшего процесса, выводится сообщение
об ошибке и программа завершается с кодом 1.
   
 ОПЦИИ 

 
 --help 
выводит описание опций программы и завершает её работу
 --version 
выводит информацию о версии программы и завершает её работу
 
   
 АВТОР 

Написана FIXME: неизвестным.
   
 ИНФОРМАЦИЯ ОБ ОШИБКАХ 

Если вы обнаружили ошибку в logname, сообщите о ней < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2004 Free Software Foundation, Inc.
 

Это свободно-распространяемый продукт; для получения подробных сведений смотрите Универсальную
Общественную Лицензию GNU. Этот продукт распространяется БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ; даже без
подразумеваемых гарантий КОММЕРЧЕСКОЙ ЦЕННОСТИ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ.
   
 СМ. ТАКЖЕ 

Полная документация по команде
 logname 

находится в Texinfo руководстве. Если программы
 info 

и 
 logname 

правильно установлены в вашей системе, тогда с помощью команды
 
 
 info coreutils logname 

 
 

вы получите возможность ознакомится с полным руководством.

   
 ПЕРЕВОД 

Перевел с английского Aleksander N.Gorohovski < angel@feht.dgtu.donetsk.ua > 22.04.2005
 

 
   Index 
 
 ИМЯ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ОПЦИИ 
 АВТОР 
 ИНФОРМАЦИЯ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename