#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 lsattr (1) >>  lsattr  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   lsattr  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

lsattr - выводит атрибуты файла второй расширенной файловой системы Linux
   
 СИНТАКСИС 

 lsattr 

[
 -RVadv 

]
[
 files... 

]
   
 ОПИСАНИЕ 

 lsattr 

выводит атрибуты файла второй расширенной файловой системы Linux, которые
могли быть установлены ранее командой chattr. Описание атрибутов файла и их
назначение см. man команды
 chattr (1)

   
 ОПЦИИ 

 
 -R 

 
Рекурсивно выводит атрибуты каталогов и их содержимого.
 -V 

 
Выводит версию программы.
 -a 

 
Выводит информацию по всем файлам в каталогах, включая скрытые файлы, чьи имена начинаются с `.'.
 -d 

 
Отображает имена каталогов также, как и остальные обычные файлы
(взамен вывода списков их содержимого).
 -v 

 
Выводит версию или номер поколения файла.
 
   
 АВТОР 

 lsattr 

написана Remy Card < Remy.Card@linux.org >. В настоящее время она
поддерживается Theodore Ts'o < tytso@alum.mit.edu >.
   
 ОШИБКИ 

Пока нет :-).
   
 МЕСТОНАХОЖДЕНИЕ 

 lsattr 

входит в состав пакета e2fsprogs и доступна через
 http://e2fsprogs.sourceforge.net. 
   
 СМ. ТАКЖЕ 

 chattr (1)


   
 ПЕРЕВОД 

Перевел с английского Aleksander N.Gorohovski < angel@feht.dgtu.donetsk.ua > 22.04.2005
 

 
   Index 
 
 ИМЯ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ОПЦИИ 
 АВТОР 
 ОШИБКИ 
 МЕСТОНАХОЖДЕНИЕ 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename