#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 nice (1)   nice  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   nice  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  nice  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   nice  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   nice  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   nice  (2)   ( Solaris man: Системные вызовы )   nice  (2)   ( Русские man: Системные вызовы )   nice  (2)   ( Linux man: Системные вызовы )   nice  (3)   ( Solaris man: Библиотечные вызовы )   nice  (3)   ( FreeBSD man: Библиотечные вызовы )   nice  (3)   ( POSIX man: Библиотечные вызовы ) Ключ  nice  обнаружен в базе ключевых слов. 
   
 НАЗВАНИЕ 

nice - запускает программу с заданием приоритета
   
 СИНТАКСИС 

 nice 

[ ПАРАМЕТР ] [ КОМАНДА  [ АРГУМЕНТ ]...]
   
 ОПИСАНИЕ 


 

Запускает КОМАНДУ с указанием приоритета ее выполнения.
Без указания КОМАНДЫ выдает текущий приоритет работы.
ADJUST по умолчанию равен 10. Диапазон приоритетов
расположен от  -20  (наивысший приоритет) до 19 (наименьший).
 
 -ADJUST 
увеличивает приоритет на ADJUST
 -n ,  --adjustment = ADJUST 
то же, что и  -ADJUST 
 --help 
выдает эту информацию и заканчивает работу
 --version 
выдает информацию о версии и заканчивает работу
 
   
 АВТОРЫ 

Создано David MacKenzie.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Сообщайте о всех ошибках на < bug-sh-utils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2000 Free Software Foundation, Inc.
 

Это свободное программное обеспечение; условия копирования
ищите в исходных текстах. НЕ существует никаких гарантий;
программа НЕ предназначена для ПРОДАЖ.
   
 СМ. ТАКЖЕ 

Полная документация для
 nice 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 nice 

нормально установлены на вашем сайте, то по команде
 
 
 info nice 

 
 

Вы получите доступ к полному руководству.

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 АВТОРЫ 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename