#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 nroff (1)   nroff  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   nroff  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  nroff  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   nroff  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня ) Ключ  nroff  обнаружен в базе ключевых слов. 
 
   
 НАЗВАНИЕ 

 
nroff - эмуляция команды nroff с помощью groff
 
   
 СИНТАКСИС 

 
 nroff  [  -h  ] [  -i  ] [  -mимя  ]
[  -nколичество  ] [  -oсписок  ] [  -rcn  ]
[  -Tимя  ] [  файл...  ]
 
   
 ОПИСАНИЕ 

 
Скрипт  nroff  эмулирует команду  nroff  с помощью groff.
Опция  -T  с аргументом, отличным от  ascii  или  latin1 ,
не воспринимается. Опция  -h  эквивалентна опции  -h  команды
 grotty . Опции  -i ,  -n ,  -m ,  -o  и  -r  действуют
согласно описанию в  troff (1) . В дополнение  nroff 
полностью игнорирует опции  -e ,  -q  и  -s .
 
   
 СМ. ТАКЖЕ 

 
 groff (1) 
,  troff (1) 
,  grotty (1) 
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename