#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 pinky (1) >>  pinky  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   pinky  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня ) 
   
 НАЗВАНИЕ 

pinky - очень простая программа определения пользователей
   
 СИНТАКСИС 

 pinky 

[ ПАРАМЕТР ]... [ ПОЛЬЗОВАТЕЛЬ ]...
   
 ОПИСАНИЕ 


 
 -l 
использовать расширенный формат - выводить длинные сообщения
 -b 
не показывать домашний каталог пользователя в расширенном формате
 -h 
не показывать содержание файла .project в домашнем 
каталоге пользователя в расширенном формате
 -p 
не показывать содержание файла .plan в домашнем 
каталоге пользователя в расширенном формате
 -s 
использовать краткий формат вывода - используемый по умолчанию
 -f 
не использовать строку заголовков в кратком формате
 -w 
не выдавать полное имя пользователя в кратком формате
 -i 
не выдавать полное имя пользователя и имя удаленного узла в кратком формате
 -q 
не выдавать полное имя пользователя, имя удаленного узла
и время простоя в кратком формате
 --help 
выдает эту информацию и заканчивает работу
 --version 
выдает информацию о версии и заканчивает работу
 
 

Простая программа идентификации пользователей, аналогична `finger';
выдает информацию о пользователях в системе.
Полное имя файла 'utmp' будет /var/run/utmp.
   
 АВТОРЫ 

Создано Joseph Arceneaux, David MacKenzie и Kaveh Ghazi.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Сообщайте о всех ошибках на < bug-sh-utils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2000 Free Software Foundation, Inc.
 

Это свободное программное обеспечение; условия копирования
ищите в исходных текстах. НЕ существует никаких гарантий;
программа НЕ предназначена для ПРОДАЖ.
   
 СМ. ТАКЖЕ 

Полная документация для
 pinky 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 pinky 

нормально установлены на вашем сайте, то по команде
 
 
 info pinky 

 
 

Вы получите доступ к полному руководству.
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 АВТОРЫ 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename