#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qcache (1) >>  qcache  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    qcache ¶ 


	 НАЗВАНИЕ ¶ 


qcache - поиск в кэше метаданных 

	 СИНТАКСИС ¶ 


	 qcache   <опции> <действие> <аргументы> 


	 ОПИСАНИЕ ¶ 


	 Доступные версии:  -[p:c:idtansvqChV] 


	 -p ,  --matchpkg  <аргумент> 


	 * Искать соответствие по названию пакета 


	 -c ,  --matchcat  <аргумент> 


	 * Искать соответствие по имени категории 


	 -i ,  --imlate 


	 * Выводить пакеты, которые могут маркироваться как стабильные для данной архитектуры 


	 -d ,  --dropped 


	 * Выводить пакеты, которые после обновления версии не имеют ключевых слов для данной архитектуры 


	 -t ,  --testing 


	 * Выводить пакеты, имеющие версии, маркированные как ~arch, и не имеющие стабильных версий для данной архитектуры 


	 -s ,  --stats 


	 * Выводить статистику дерева портежей 


	 -a ,  --all 


	 * Выводить пакеты, у которых хотя бы одна версия имеет ключевое слово для данной архитектуры 


	 -n ,  --not 


	 * Выводить пакеты, которые не имеют ключевых слов для данной архитектуры 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qcache.1,v 1.6 2007/05/11 08:25:06 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Май 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename