#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qgrep (1) >>  qgrep  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    qgrep ¶ 


	 НАЗВАНИЕ ¶ 


qgrep - поиск по шаблону в ебилдах 

	 СИНТАКСИС ¶ 


	 qgrep   <различные аргументы> 


	 ОПИСАНИЕ ¶ 


	 Доступные опции:  -[IiHNclLexJEsS:B:A:vqChV] 


	 -I ,  --invert-match 


	 * Выбрать все строки, кроме совпадающих с шаблоном 


	 -i ,  --ignore-case 


	 * Игнорировать регистр 


	 -H ,  --with-filename 


	 * Выводить имя файла при каждом совпадении 


	 -N ,  --with-name 


	 * Выводить имя пакета или екласса при каждом совпадении 


	 -c ,  --count 


	 * Выводить только количество строк на ФАЙЛ, совпадающих с шаблоном 


	 -l ,  --list 


	 * Выводить только имена ФАЙЛов, совпадающие с шаблоном 


	 -L ,  --invert-list 


	 * Выводить только имена ФАЙЛов, не совпадающие с шаблоном 


	 -e ,  --regexp 


	 * Использовать как ШАБЛОН регулярное выражение 


	 -x ,  --extended 


	 * Использовать как ШАБЛОН расширенное регулярное выражение 


	 -J ,  --installed 


	 * Искать не в дереве, а в установленных ебилдах 


	 -E ,  --eclass 


	 * Искать не в ебилдах, а в еклассах 


	 -s ,  --skip-comments 


	 * Пропускать строки комментариев 


	 -S ,  --skip  <аргумент> 


	   * Пропускать строки, совпадающие с шаблоном в <аргументе> 


	 -B ,  --before  <аргумент> 


	   * Выводить строки, содержащие <аргумент> в начале 


	 -A ,  --after  <аргумент> 


	   * Выводить строки, содержащие <аргумент> в конце 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qgrep.1,v 1.17 2007/04/05 18:25:27 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Апрель 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename