#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qlist (1) >>  qlist  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    qlist ¶ 


	 НАЗВАНИЕ ¶ 


qlist - вывести файлы, принадлежащие данному пакету 

	 СИНТАКСИС ¶ 


	 qlist   <опции> <пакет> 


	 ОПИСАНИЕ ¶ 


	 Доступные опции:  -[ISULDeadosvqChV] 


	 -I ,  --installed 


	 * Показывать только установленные пакеты 


	 -S ,  --slots 


	 * Отображать установленные пакеты со слотами 


	 -L ,  --separator 


	 * Использовать : в качестве разделителя слота 


	 -U ,  --umap 


	 * Отображать установленные пакеты с используемыми флагами 


	 -D ,  --dups 


	 * Показывать только пакеты с копиями 


	 -e ,  --exact 


	 * Точное соответствие (только CAT/PN или PN без PV) 


	 -a ,  --all 


	 * Показывать все установленные пакеты 


	 -d ,  --dir 


	 * Показывать только каталоги 


	 -o ,  --obj 


	 * Показывать только объекты 


	 -s ,  --sym 


	 * Показывать только символические ссылки 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qlist.1,v 1.24 2007/09/08 06:31:48 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Сентябрь 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename