#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qmerge (1) >>  qmerge  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    qmerge ¶ 


	 НАЗВАНИЕ ¶ 


qmerge - скачивание и установка бинарного пакета 

	 СИНТАКСИС ¶ 


	 qmerge   <опции> <пакеты> 


	 ОПИСАНИЕ ¶ 


	 Доступные опции:  -[fFsKUpuyO5vqChV] 


	 -f ,  --fetch 


	 * Скачать пакет и последние метаданные пакетов 


	 -F ,  --force 


	 * Скачать пакет (минуя метаданные) 


	 -s ,  --search 


	 * Искать среди доступных пакетов 


	 -K ,  --install 


	 * Установить пакет 


	 -U ,  --unmerge 


	 * Удалить пакет 


	 -p ,  --pretend 


	 * Симулировать действие 


	 -u ,  --update 


	 * Только обновить 


	 -y ,  --yes 


	 * Не спрашивать перед перезаписью 


	 -O ,  --nodeps 


	 * Не устанавливать зависимости 


	 -5 ,  --nomd5 


	 * Не проверять MD5-хеш файлов 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qmerge.1,v 1.14 2007/05/11 08:25:06 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Май 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename