#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 sleep (1)   sleep  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   sleep  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  sleep  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   sleep  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   sleep  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   sleep  (3)   ( Solaris man: Библиотечные вызовы )   sleep  (3)   ( FreeBSD man: Библиотечные вызовы )   sleep  (3)   ( Русские man: Библиотечные вызовы )   sleep  (3)   ( Linux man: Библиотечные вызовы )   sleep  (3)   ( POSIX man: Библиотечные вызовы )   sleep  (9)   ( FreeBSD man: Ядро ) Ключ  sleep  обнаружен в базе ключевых слов. 
   
 НАЗВАНИЕ 

sleep - задежка на указанное время
   
 СИНТАКСИС 

 sleep 

 ЧИСЛО [ СУФФИКС ]...
 

 sleep 

 ПАРАМЕТР 
   
 ОПИСАНИЕ 


 

Остановиться на указанное ЧИСЛО секунд. СУФФИКС может принимать значения `s' для
секунд (по умолчанию), `m' для минут, `h' для часов и `d' для дней. Хотя большинство
реализаций требуют указания ЧИСЛА, как целого значения, здесь ЧИСЛО может быть
числом с плавающей запятой.
 
 --help 
выдает эту информацию и заканчивает работу
 --version 
выдает информацию о версии и заканчивает работу
 
   
 АВТОРЫ 

Создано Jim Meyering и Paul Eggert.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Сообщайте о всех ошибках на < bug-sh-utils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2000 Free Software Foundation, Inc.
 

Это свободное программное обеспечение; условия копирования
ищите в исходных текстах. НЕ существует никаких гарантий;
программа НЕ предназначена для ПРОДАЖ.
   
 СМ. ТАКЖЕ 

Полная документация для
 sleep 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 sleep 

нормально установлены на вашем сайте, то по команде
 
 
 info sleep 

 
 

Вы получите доступ к полному руководству.

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 АВТОРЫ 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename