#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 tty (1)   tty  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   tty  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  tty  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   tty  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   tty  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   tty  (4)   ( FreeBSD man: Специальные файлы /dev/* )   tty  (4)   ( Русские man: Специальные файлы /dev/* )   tty  (4)   ( Linux man: Специальные файлы /dev/* )   tty  (7)   ( Solaris man: Макропакеты и соглашения ) Ключ  tty  обнаружен в базе ключевых слов. 
   
 НАЗВАНИЕ 

tty - выводит имя терминала соединённого со стандартным вводом
   
 СИНТАКСИС 

 tty 

[ ОПЦИИ ]...
   
 ОПИСАНИЕ 


 

Команда  tty  выводит имя терминала подключенного к стандартному вводу. В случае если стандартный ввод не является терминалом выводит сообщение "not a tty".
 
 -s ,  --silent ,  --quiet 
ничего не выводить, вернуть только состояние при завершении.
 --help 
отобразить эту помощь и выйти.
 --version 
вывести информацию о версии программы и завершить работу.
 
   
 КОДЫ ВОЗВРАТА 

Коды возвращаемые tty при завершении работы:
 
 0 если стандартный ввод подключен к терминалу
1 если стандартный ввод это не терминал
2 если заданы неверные аргументы
3 если возникла ошибка записи
 
 

   
 АВТОР 

Программа написана Девидом Маккензи (David MacKenzie).
   
 ОТЧЁТЫ ОБ ОШИБКАХ 

При обнаружении ошибки отправьте отчёт на адрес < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2004 Free Software Foundation, Inc.
 

Это свободное программное обеспечение; условия распространения смотрите в исходных кодах. Никаких гарантий НЕ предоставляется, ни при использовании в КОММЕРЧЕСКИХ ни в ЛЮБЫХ ДРУГИХ ЦЕЛЯХ.
   
 СМ. ТАКЖЕ 

Полная документация по команде
 tty 

поддерживается в руководстве Texinfo. Если программы
 info 

и
 tty 

на вашей системе установлены должным образом, то командой
 
 
 info coreutils tty 

 
 

можно открыть полное руководство. (Для русского перевода страница man  tty (1) была дополнена из страницы справочника info tty.)
   
 ПЕРЕВОД 

Василий Коломеец (Vasily Kolomeets) < boojuman@gmail.com >
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 КОДЫ ВОЗВРАТА 
 АВТОР 
 ОТЧЁТЫ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename