#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 uname (1)   uname  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   uname  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  uname  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   uname  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   uname  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   uname  (2)   ( Solaris man: Системные вызовы )   uname  (2)   ( Русские man: Системные вызовы )   uname  (2)   ( Linux man: Системные вызовы )   uname  (3)   ( FreeBSD man: Библиотечные вызовы )   uname  (3)   ( POSIX man: Библиотечные вызовы )   uname  (8)   ( Русские man: Команды системного администрирования ) 
   
 НАЗВАНИЕ 

uname - сообщает информацию о данном компьютере и операционной системе
   
 СИНТАКСИС 

 uname 

[ ПАРАМЕТРЫ ]...
   
 ОПИСАНИЕ 


 

Выводит подробную системную информацию. Команда, запущенная без ПАРАМЕТРОВ, подобна
применению её с параметром  -s .
 
 -a ,  --all 
выводит подробную информацию в следующем порядке:
 -s ,  --kernel-name 
выводит название ядра операционной системы
 -n ,  --nodename 
выводит сетевое название узла
 -r ,  --kernel-release 
выводит выпуск ядра операционной системы
 -v ,  --kernel-version 
выводит версию ядра операционной системы, включая дату выпуска
 -m ,  --machine 
выводит сведения о типе компьютера
 -p ,  --processor 
выводит тип процессора для данного компьютера
 -i ,  --hardware-platform 
выводит сведения о платформе компьютера
 -o ,  --operating-system 
выводит тип операционной системы
 --help 
выводит это описание к программе и завершает её работу
 --version 
выводит информацию о версии программы и завершает работу
 
   
 АВТОР 

Написана David MacKenzie.
   
 ИНФОРМАЦИЯ ОБ ОШИБКАХ 

Если вы обнаружили ошибку в команде uname, сообщите о ней < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2004 Free Software Foundation, Inc.
 

Это свободно-распространяемый продукт; для получения подробных сведений смотрите Универсальную
Общественную Лицензию GNU. Этот продукт распространяется БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ; даже без
подразумеваемых гарантий КОММЕРЧЕСКОЙ ЦЕННОСТИ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ.
   
 СМ. ТАКЖЕ 

Полная документация по команде
 uname 

находится в руководстве Texinfo. Если программы
 info 

и
 uname 

правильно установлены в вашей системе, тогда с помощью команды
 
 
 info coreutils uname 

 
 

вы получите возможность ознакомиться с полным руководством.

   
 ПЕРЕВОД 

оригинального файла на английском uname.1.gz (828 байт от 03.06.2004)
выполнен Aleksander N.Gorohovski < angel@feht.dgtu.donetsk.ua > 21.11.2006.
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 АВТОР 
 ИНФОРМАЦИЯ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename