#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 vimtutor (1)   vimtutor  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня ) >>  vimtutor  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   vimtutor  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

vimtutor - учебник по Vim
   
 КОМАНДНАЯ СТРОКА 

 

 vimtutor [язык] 

   
 ОПИСАНИЕ 

Команда
 vimtutor 

запускает учебник по
 Vim. 

При этом сначала происходит создание копии файла учебника, 
чтобы его можно было редактировать без опасения потерять исходный файл.
 

Программа
 vimtutor 

полезна для новичков, желающих научиться самым основным командам
 Vim. 

 

Необязательный параметр [язык] представляет собой двухсимвольный код языка,
например "ru" или "it".
Если параметр [язык] не указан, то используется язык активной в настоящий 
момент локали. Если учебник на этом языке не существует, то по умолчанию 
используется учебник на английском языке.
 

При работе с учебником
 Vim 

всегда запускается в режиме совместимости с Vi.
   
 ФАЙЛЫ 

 
 /usr/share/vim/tutor/tutor[.язык] 
Текст учебника
 vimtutor. 

 /usr/share/vim/tutor/tutor.vim 
Сценарий Vim, который используется для создания рабочей
копии текста учебника
 vimtutor. 

 
   
 АВТОРЫ 

 Vimtutor 

был впервые написан для Vi Майклом К. Пирсом (Michael C. Pierce) и
Робертом К. Уэа (Robert K. Ware) из Colorado School of Mines по
идее Чарльза Смита (Charles Smith) из Colorado State University.
E-mail:  bware@mines.colorado.edu .
 

Впоследствии учебник был доработан для использования в 
 Vim 

Брамом Мооленааром (Bram Moolenaar).
Имена переводчиков учебника упоминаются в соответствующих файлах.
   
 СМОТРИ ТАКЖЕ 

 vim (1)
 

 
   Index 
 
 ИМЯ 
 КОМАНДНАЯ СТРОКА 
 ОПИСАНИЕ 
 ФАЙЛЫ 
 АВТОРЫ 
 СМОТРИ ТАКЖЕ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename