#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 zmore (1)   zmore  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  zmore  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   zmore  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня ) 
   
 п²п░п≈п▓п░п²п≤п∙ 

zmore - я└п╦п╩я▄я┌я─ п╢п╩я▐ я█п╨я─п╟п╫п╫п╬пЁп╬ п©я─п╬я│п╪п╬я┌я─п╟ я│п╤п╟я┌п╬пЁп╬ я┌п╣п╨я│я┌п╟
   
 п║п≤п²п╒п░п п║п≤п║ 

 zmore  [ я└п╟п╧п╩ ... ]
   
 п·п÷п≤п║п░п²п≤п∙ 

 

 Zmore  я▐п╡п╩я▐п╣я┌я│я▐ я└п╦п╩я▄я┌я─п╬п╪, п©п╬п╥п╡п╬п╩я▐я▌я┴п╦п╪ п©я─п╬я│п╪п╟я┌я─п╦п╡п╟я┌я▄ я│п╤п╟я┌я▀п╣ п╦п╩п╦ п╫п╣я│п╤п╟я┌я▀п╣ я┌п╣п╨я│я┌п╬п╡я▀п╣ я└п╟п╧п╩я▀ п©п╬ п╬п╢п╫п╬п╪я┐ я█п╨я─п╟п╫я┐ п╥п╟ я─п╟п╥ п╫п╟ я│я┌п╦я─п╟п╣п╪я▀я┘ я┌п╣я─п╪п╦п╫п╟п╩п╟я┘.
 zmore  я─п╟п╠п╬я┌п╟п╣я┌ я│ я└п╟п╧п╩п╟п╪п╦, я│п╤п╟я┌я▀п╪п╦  compress ,  pack  п╦п╩п╦  gzip , п╟ я┌п╟п╨п╤п╣ я│ п╫п╣я│п╤п╟я┌я▀п╪п╦ я└п╟п╧п╩п╟п╪п╦. п∙я│п╩п╦ я┐п╨п╟п╥п╟п╫п╫п╬пЁп╬ я└п╟п╧п╩п╟ п╫п╣ я│я┐я┴п╣я│я┌п╡я┐п╣я┌,
 zmore  п╦я┴п╣я┌ я└п╟п╧п╩ я│ я┌п╟п╨п╦п╪-п╤п╣ п╦п╪п╣п╫п╣п╪ я│ я│я┐я└я└п╦п╨я│п╬п╪ .gz, .z п╦п╩п╦ .Z.
 

 Zmore  п╬п╠я▀я┤п╫п╬ п╢п╣п╩п╟п╣я┌ п╬я│я┌п╟п╫п╬п╡п╨я┐ п©п╬я│п╩п╣ п╨п╟п╤п╢п╬пЁп╬ п╥п╟п©п╬п╩п╫п╣п╫п╫п╬пЁп╬ я█п╨я─п╟п╫п╟, п©п╣я┤п╟я┌п╟я▐ --More-- п╡п╫п╦п╥я┐ я█п╨я─п╟п╫п╟. п∙я│п╩п╦ п©п╬п╩я▄п╥п╬п╡п╟я┌п╣п╩я▄ п╥п╟я┌п╣п╪ п╫п╟п╤п╦п╪п╟п╣я┌ п╨п╩п╟п╡п╦я┬я┐ "п▓п╡п╬п╢", п©п╬п╨п╟п╥я▀п╡п╟п╣я┌я│я▐ п╣я┴я▒ п╬п╢п╫п╟ я│я┌я─п╬п╨п╟. п∙я│п╩п╦ п©п╬п╩я▄п╥п╬п╡п╟я┌п╣п╩я▄ п╫п╟п╤п╦п╪п╟п╣я┌ п╨п╩п╟п╡п╦я┬я┐ "п÷я─п╬п╠п╣п╩", п©п╬п╨п╟п╥я▀п╡п╟п╣я┌я│я▐ я│п╩п╣п╢я┐я▌я┴п╦п╧ я█п╨я─п╟п╫ я┌п╣п╨я│я┌п╟. п■я─я┐пЁп╦п╣ п╡п╬п╥п╪п╬п╤п╫п╬я│я┌п╦ п©п╣я─п╣я┤п╦я│п╩п╣п╫я▀ п╫п╦п╤п╣.
 

 Zmore  п╦п╥я┐я┤п╟п╣я┌ я└п╟п╧п╩  /etc/termcap , я┤я┌п╬п╠я▀ п╬п©я─п╣п╢п╣п╩п╦я┌я▄ я┘п╟я─п╟п╨я┌п╣я─п╦я│я┌п╦п╨п╦ я┌п╣я─п╪п╦п╫п╟п╩п╟ п╦ я─п╟п╥п╪п╣я─ п╬п╨п╫п╟ п©п╬ я┐п╪п╬п╩я┤п╟п╫п╦я▌. п²п╟ я┌п╣я─п╪п╦п╫п╟п╩п╟я┘, я│п©п╬я│п╬п╠п╫я▀я┘ п╬я┌п╬п╠я─п╟п╤п╟я┌я▄ 24 я│я┌я─п╬п╨п╦, п©п╬ я┐п╪п╬п╩я┤п╟п╫п╦я▌ я─п╟п╥п╪п╣я─ п╬п╨п╫п╟ я─п╟п╡п╣п╫ 22 я│я┌я─п╬п╨п╟п╪. п■п╩я▐ п╦я│п©п╬п╩я▄п╥п╬п╡п╟п╫п╦я▐ п©я─п╬пЁя─п╟п╪п╪я▀ п©я─п╬я│п╪п╬я┌я─п╟, п╬я┌п╩п╦я┤п╫п╬п╧ п╬я┌  more , п╦я│п©п╬п╩я▄п╥я┐п╣п╪п╬п╧ п©п╬ я┐п╪п╬п╩я┤п╟п╫п╦я▌, я┐я│я┌п╟п╫п╬п╡п╦я┌п╣ п╡ п©п╣я─п╣п╪п╣п╫п╫п╬п╧ п╬п╨я─я┐п╤п╣п╫п╦я▐ PAGER п╦п╪я▐ п╤п╣п╩п╟п╣п╪п╬п╧ п©я─п╬пЁя─п╟п╪п╪я▀, п╫п╟п©я─п╦п╪п╣я─  less .
 

п║п©п╦я│п╬п╨ п╢я─я┐пЁп╦я┘ п╨п╩п╟п╡п╦п╟я┌я┐я─п╫я▀я┘ п╨п╬п╪п╠п╦п╫п╟я├п╦п╧, п╨п╬я┌п╬я─я▀п╣ п╪п╬п╤п╫п╬ п╡п╡п╬п╢п╦я┌я▄, п╨п╬пЁп╢п╟  zmore  п╢п╣я─п╤п╦я┌ п©п╟я┐п╥я┐, п╦ я█я└я└п╣п╨я┌п╬п╡ п╬я┌ п╦я┘ п╢п╣п╧я│я┌п╡п╦я▐ ( i  - п╫п╣п╬п╠я▐п╥п╟я┌п╣п╩я▄п╫я▀п╧ я├п╣п╩я▀п╧ п©п╟я─п╟п╪п╣я┌я─, п©п╬ я┐п╪п╬п╩я┤п╟п╫п╦я▌ я─п╟п╡п╫я▀п╧ 1):
 

 
 i 
п©п╬п╨п╟п╥п╟я┌я▄  i  п╢п╬п©п╬п╩п╫п╦я┌п╣п╩я▄п╫я▀я┘ я│я┌я─п╬п╨ я┌п╣п╨я│я┌п╟, (п╦п╩п╦ я│п╩п╣п╢я┐я▌я┴п╦п╧ я├п╣п╩я▀п╧ я█п╨я─п╟п╫, п╣я│п╩п╦ п©п╟я─п╟п╪п╣я┌я─я┐ п╫п╣ п╫п╟п╥п╫п╟я┤п╣п╫п╬ п╥п╫п╟я┤п╣п╫п╦п╣)
 
 

 
 ^D 
п╬я┌п╬п╠я─п╟п╥п╦я┌я▄ 11 я│п╩п╣п╢я┐я▌я┴п╦я┘ я│я┌я─п╬п╨ ("п©я─п╬п╨я─я┐я┌п╨п╟"). п∙я│п╩п╦ я┐п╨п╟п╥п╟п╫п╬  i , я┌п╬ п╡п╣п╩п╦я┤п╦п╫п╟ п©я─п╬п╨я─я┐я┌п╨п╦ я┐я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣я┌я│я▐ п╡  i .
 
 

 
 d 
я┌п╬-п╤п╣, я┤я┌п╬ п╦ ^D (control-D)
 
 

 
 i z 
я┌п╬-п╤п╣ я│п╟п╪п╬п╣, я┤я┌п╬ п╦ п©я─п╬п╠п╣п╩, п╥п╟ п╦я│п╨п╩я▌я┤п╣п╫п╦п╣п╪ я┌п╬пЁп╬, я┤я┌п╬  i , п╣я│п╩п╦ я┐п╨п╟п╥п╟п╫, я│я┌п╟п╫п╬п╡п╦я┌я│я▐ п╫п╬п╡я▀п╪ я─п╟п╥п╪п╣я─п╬п╪ п╬п╨п╫п╟. пёя┤я┌п╦я┌п╣, я┤я┌п╬ я─п╟п╥п╪п╣я─ п╬п╨п╫п╟ п╡п╬я│я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣я┌я│я▐ п╬п╠я─п╟я┌п╫п╬ (п╡ п╥п╫п╟я┤п╣п╫п╦п╣ п©п╬ я┐п╪п╬п╩я┤п╟п╫п╦я▌) п╡ п╨п╬п╫я├п╣ я┌п╣п╨я┐я┴п╣пЁп╬ я└п╟п╧п╩п╟.
 
 

 
 i s 
п©я─п╬п©я┐я│я┌п╦я┌я▄  i  я│я┌я─п╬п╨ п╦ п╡я▀п╡п╣я│я┌п╦ п╥п╟п©п╬п╩п╫п╣п╫п╫я▀п╧ я█п╨я─п╟п╫.
 
 

 
 i f 
п©я─п╬п©я┐я│я┌п╦я┌я▄  i  я█п╨я─п╟п╫п╬п╡ п╦ п╡я▀п╡п╣я│я┌п╦ п©п╬п╩п╫я▀п╧ я█п╨я─п╟п╫.
 
 

 
 q 
п╡я▀п╧я┌п╦ п╦п╥ п©я─п╬я│п╪п╬я┌я─п╟ я┌п╣п╨я┐я┴п╣пЁп╬ я└п╟п╧п╩п╟; п©п╣я─п╣п╧я┌п╦ п╨ я│п╩п╣п╢я┐я▌я┴п╣п╪я┐ (п╣я│п╩п╦ п╣я│я┌я▄).
 
 

 
 e п╦п╩п╦ q 
п╨п╬пЁп╢п╟ п©п╬я▐п╡п╩я▐п╣я┌я│я▐ я│п╬п╬п╠я┴п╣п╫п╦п╣ --More--(Next file:  я└п╟п╧п╩ ), я█я┌п╟ п╨п╬п╪п╟п╫п╢п╟ п╥п╟я│я┌п╟п╡п╩я▐п╣я┌ zmore п╥п╟п╡п╣я─я┬п╦я┌я▄ я─п╟п╠п╬я┌я┐.
 
 

 
 s 
п╨п╬пЁп╢п╟ п©п╬я▐п╡п╩я▐п╣я┌я│я▐ я│п╬п╬п╠я┴п╣п╫п╦п╣ --More--(Next file:  я└п╟п╧п╩ ), я█я┌п╟ п╨п╬п╪п╟п╫п╢п╟ п╥п╟я│я┌п╟п╡п╩я▐п╣я┌ zmore п©я─п╬п©я┐я│я┌п╦я┌я▄ я│п╩п╣п╢я┐я▌я┴п╦п╧ я└п╟п╧п╩ п╦ п©я─п╬п╢п╬п╩п╤п╦я┌я▄ я─п╟п╠п╬я┌я┐.
 
 

 
 = 
п©п╬п╨п╟п╥п╟я┌я▄ п╫п╬п╪п╣я─ я┌п╣п╨я┐я┴п╣п╧ я│я┌я─п╬п╨п╦.
 
 

 
 i /я─п╣пЁя┐п╩я▐я─п╫п╬п╣ 
п╦я│п╨п╟я┌я▄  i -п╨я─п╟я┌п╫п╬п╣ я─п╣пЁя┐п╩я▐я─п╫п╬п╣  п╡я▀я─п╟п╤п╣п╫п╦п╣ . п∙я│п╩п╦ я│я┌я─п╬п╨п╟ п╫п╣ п╫п╟п╧п╢п╣п╫п╟,  zmore  п©п╣я─п╣я┘п╬п╢п╦я┌ п╨ я│п╩п╣п╢я┐я▌я┴п╣п╪я┐ я└п╟п╧п╩я┐ (п╣я│п╩п╦ п╣я│я┌я▄). п▓ п©я─п╬я┌п╦п╡п╫п╬п╪ я│п╩я┐я┤п╟п╣, п╡я▀п╡п╬п╢п╦я┌я│я▐ п©п╬п╩п╫я▀п╧ я█п╨я─п╟п╫, п╫п╟я┤п╦п╫п╟я▐ п╥п╟ п╢п╡п╣ я│я┌я─п╬п╨п╦ п╢п╬ п╪п╣я│я┌п╟, пЁп╢п╣ п╠я▀п╩п╬ п╫п╟п╧п╢п╣п╫п╬ п╦я│п╨п╬п╪п╬п╣ я─п╣пЁя┐п╩я▐я─п╫п╬п╣ п╡я▀я─п╟п╤п╣п╫п╦п╣. п п╩п╟п╡п╦я┬п╦ Backspace п╦ Delete п╪п╬пЁя┐я┌ п╠я▀я┌я▄ п╦я│п©п╬п╩я▄п╥п╬п╡п╟п╫я▀ п╢п╩я▐ я─п╣п╢п╟п╨я┌п╦я─п╬п╡п╟п╫п╦я▐ я─п╣пЁя┐п╩я▐я─п╫п╬пЁп╬ п╡я▀я─п╟п╤п╣п╫п╦я▐. п║я┌п╦я─п╟п╫п╦п╣ п╫п╟п╥п╟п╢ п╡ п©п╣я─п╡п╬п╧ п╨п╬п╩п╬п╫п╨п╣ я█п╨я─п╟п╫п╟ п╬я┌п╪п╣п╫я▐п╣я┌ п╨п╬п╪п╟п╫п╢я┐ п©п╬п╦я│п╨п╟.
 
 

 
 i n 
п╦я│п╨п╟я┌я▄  i -п╨я─п╟я┌п╫п╬п╣ п©п╬я▐п╡п╩п╣п╫п╦п╣ п©п╬я│п╩п╣п╢п╫п╣пЁп╬ п╡п╡п╣п╢я▒п╫п╫п╬пЁп╬ я─п╣пЁя┐п╩я▐я─п╫п╬пЁп╬ п╡я▀я─п╟п╤п╣п╫п╦я▐.
 
 

 
 !п╨п╬п╪п╟п╫п╢п╟ 
п╡я▀п╥п╬п╡ п╨п╬п╪п╟п╫п╢п╫п╬пЁп╬ п╦п╫я┌п╣я─п©я─п╣я┌п╟я┌п╬я─п╟ я│  п╨п╬п╪п╟п╫п╢п╬п╧ . п║п╦п╪п╡п╬п╩ "!" п╡ п╨п╬п╪п╟п╫п╢п╣ п╥п╟п╪п╣п╫я▐п╣я┌я│я▐ п╫п╟ п©я─п╣п╢я▀п╢я┐я┴я┐я▌ п╨п╬п╪п╟п╫п╢я┐ п╬п╠п╬п╩п╬я┤п╨п╦. п║п╬я┤п╣я┌п╟п╫п╦п╣ "\!" п╥п╟п╪п╣п╫я▐п╣я┌я│я▐ п╫п╟ "!".
 
 

 
 :q 
п╡я▀п╧я┌п╦ п╦п╥ п©я─п╬я│п╪п╬я┌я─п╟ я┌п╣п╨я┐я┴п╣пЁп╬ я└п╟п╧п╩п╟; п©п╣я─п╣п╧я┌п╦ п╨ я│п╩п╣п╢я┐я▌я┴п╣п╪я┐ (п╣я│п╩п╦ п╣я│я┌я▄) (я┌п╬-п╤п╣, я┤я┌п╬ п╦ q п╦п╩п╦ Q).
 
 

 
 . 
(я┌п╬я┤п╨п╟) п©п╬п╡я┌п╬я─п╦я┌я▄ п©я─п╣п╢я▀п╢я┐я┴я┐я▌ п╨п╬п╪п╟п╫п╢я┐.
 
 

п п╬п╪п╟п╫п╢я▀ п╢п╣п╧я│я┌п╡я┐я▌я┌ п╫п╣п╪п╣п╢п╩п╣п╫п╫п╬, я┌.п╣. п╫п╣ п╬п╠я▐п╥п╟я┌п╣п╩я▄п╫п╬ п╫п╟п╤п╦п╪п╟я┌я▄ "п▓п╡п╬п╢".
п■п╬ я┌п╬пЁп╬, п╨п╟п╨ п╥п╟п╢п╟п╫п╟ п╨п╩п╟п╡п╦я┬п╟ п╡я▀п╥п╬п╡п╟ я│п╟п╪п╬п╧ п╨п╬п╪п╟п╫п╢я▀, п©п╬п╩я▄п╥п╬п╡п╟я┌п╣п╩я▄ п╪п╬п╤п╣я┌
п╫п╟п╤п╟я┌я▄ п╨п╩п╟п╡п╦я┬я┐ я│я┌п╦я─п╟п╫п╦я▐ п╫п╟п╥п╟п╢, я┤я┌п╬п╠я▀ п╬я┌п╪п╣п╫п╦я┌я▄ я└п╬я─п╪п╦я─я┐п╣п╪я▀п╧ я├п╦я└я─п╬п╡п╬п╧ п©п╟я─п╟п╪п╣я┌я─. п▓ п╢п╬п╠п╟п╡п╬п╨ п╨ я█я┌п╬п╪я┐, п©п╬п╩я▄п╥п╬п╡п╟я┌п╣п╩я▄ п╪п╬п╤п╣я┌ п╫п╟п╤п╟я┌я▄ п╨п╩п╟п╡п╦я┬я┐ я│я┌п╦я─п╟п╫п╦я▐, я┤я┌п╬п╠я▀ п©п╬п╨п╟п╥п╟я┌я▄ п╣я┴я▒ я─п╟п╥ я│п╬п╬п╠я┴п╣п╫п╦п╣ --More--.
 

п▓ п╩я▌п╠п╬п╧ п╪п╬п╪п╣п╫я┌ п╡я─п╣п╪п╣п╫п╦ п©я─п╦ п©п╣я─п╣п╢п╟я┤п╣ п╢п╟п╫п╫я▀я┘ п╫п╟ я┌п╣я─п╪п╦п╫п╟п╩, п©п╬п╩я▄п╥п╬п╡п╟я┌п╣п╩я▄ п╪п╬п╤п╣я┌ п╫п╟п╠я─п╟я┌я▄ п╨п╬п╪п╠п╦п╫п╟я├п╦я▌ п╨п╩п╟п╡п╦я┬ п╢п╩я▐ п╡я▀я┘п╬п╢п╟ (п╬п╠я▀я┤п╫п╬ control-\).  Zmore  п╬я│я┌п╟п╫п╬п╡п╦я┌ п╡я▀п╡п╬п╢ п╫п╟ я┌п╣я─п╪п╦п╫п╟п╩ п╦ п©п╬п╨п╟п╤п╣я┌ п╬п╠я▀я┤п╫п╬п╣ п©я─п╦пЁп╩п╟я┬п╣п╫п╦п╣ --More--. п■п╟п╩п╣п╣, п©п╬п╩я▄п╥п╬п╡п╟я┌п╣п╩я▄ п╪п╬п╤п╣я┌ п╡п╡п╣я│я┌п╦ п╬п╢п╫я┐ п╦п╥ п╡я▀я┬п╣п©п╣я─п╣я┤п╦я│п╩п╣п╫п╫я▀я┘ п╨п╬п╪п╟п╫п╢ п╬п╠я▀я┤п╫я▀п╪ п╬п╠я─п╟п╥п╬п╪. п  я│п╬п╤п╟п╩п╣п╫п╦я▌, п╫п╣п╨п╬я┌п╬я─п╟я▐ я┤п╟я│я┌я▄ п╢п╟п╫п╫я▀я┘
п©я─п╦ я█я┌п╬п╪ я┌п╣я─я▐п╣я┌я│я▐, я┌.п╨. п╩я▌п╠я▀п╣ я│п╦п╪п╡п╬п╩я▀, п╤п╢я┐я┴п╦п╣ п╡ п╬я┤п╣я─п╣п╢п╦ п╡я▀п╡п╬п╢п╟ п╫п╟ я┌п╣я─п╪п╦п╫п╟п╩, я│п╠я─п╟я│я▀п╡п╟я▌я┌я│я▐ п©я─п╦ п©п╬п╩я┐я┤п╣п╫п╦п╦ я│п╦пЁп╫п╟п╩п╟ "п╡я▀я┘п╬п╢".
 

п╒п╣я─п╪п╦п╫п╟п╩ п╢п╟п╫п╫п╬п╧ п©я─п╬пЁя─п╟п╪п╪п╬п╧ я┐я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣я┌я│я▐ п╡ я─п╣п╤п╦п╪ я─п╟п╠п╬я┌я▀  noecho , п╢п╩я▐ я┌п╬пЁп╬ я┤я┌п╬п╠я▀ п╡я▀п╡п╬п╢ п╠я▀п╩ п╫п╣п©я─п╣я─я▀п╡п╫я▀п╪. п╒п╟п╨п╦п╪ п╬п╠я─п╟п╥п╬п╪ я┌п╬, я┤я┌п╬ п╡я▀ п©п╣я┤п╟я┌п╟п╣я┌п╣, п╫п╣ п╠я┐п╢п╣я┌ п©п╬п╨п╟п╥я▀п╡п╟я┌я▄я│я▐ п╫п╟ я┌п╣я─п╪п╦п╫п╟п╩п╣, п╥п╟ п╦я│п╨п╩я▌я┤п╣п╫п╦п╣п╪ п╨п╬п╪п╟п╫п╢ / п╦ !.
 

п∙я│п╩п╦ я│я┌п╟п╫п╢п╟я─я┌п╫я▀п╧ п©п╬я┌п╬п╨ п╡я▀п╡п╬п╢п╟ п╫п╣ я▐п╡п╩я▐п╣я┌я│я▐ я│я┌п╦я─п╟п╣п╪я▀п╪ я┌п╣я─п╪п╦п╫п╟п╩п╬п╪,  zmore  п╡п╣п╢я▒я┌ я│п╣п╠я▐ п╨п╟п╨  zcat , п╥п╟ п╦я│п╨п╩я▌я┤п╣п╫п╦п╣п╪ я┌п╬пЁп╬, я┤я┌п╬ п╬п╫ п©п╣я┤п╟я┌п╟п╣я┌ п╥п╟пЁп╬п╩п╬п╡п╬п╨ п©п╣я─п╣п╢ п╨п╟п╤п╢я▀п╪ я└п╟п╧п╩п╬п╪.
   
 п╓п░п≥п⌡п╚ 

 
 /etc/termcap 
п▒п╟п╥п╟ п╢п╟п╫п╫я▀я┘ я┌п╣я─п╪п╦п╫п╟п╩п╬п╡
 
   
 п║п°п·п╒п═п≤ п╒п░п п√п∙ 

 more (1),  gzip (1),  zdiff (1),  zgrep (1),  znew (1),  zforce (1),  gzexe (1)
 

 
   Index 
 
 п²п░п≈п▓п░п²п≤п∙ 
 п║п≤п²п╒п░п п║п≤п║ 
 п·п÷п≤п║п░п²п≤п∙ 
 п╓п░п≥п⌡п╚ 
 п║п°п·п╒п═п≤ п╒п░п п√п∙ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename