#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 nologin (5)   nologin  (4)   ( Solaris man: Специальные файлы /dev/* )   nologin  (5)   ( FreeBSD man: Форматы файлов ) >>  nologin  (5)   ( Русские man: Форматы файлов )   nologin  (5)   ( Linux man: Форматы файлов )   nologin  (8)   ( FreeBSD man: Команды системного администрирования )   nologin  (8)   ( Русские man: Команды системного администрирования )   nologin  (8)   ( Linux man: Команды системного администрирования ) 
   
 ИМЯ 

nologin - предотвращает вход в систему пользователей, отличных от root
   
 ОПИСАНИЕ 

Если существует файл  /etc/nologin , то
 login (1)

будет разрешать доступ в систему только пользователю root.  Остальным
пользователям будет показано содержимое этого файла, а в доступе в
систему будет отказано.
   
 ФАЙЛЫ 

/etc/nologin
   
 СМОТРИ ТАКЖЕ 

 login (1),

 shutdown (8)

   
 ПЕРЕВОД 

Перевёл с английского Виктор Вислобоков < corochoone@perm.ru > 2004
 

 
   Index 
 
 ИМЯ 
 ОПИСАНИЕ 
 ФАЙЛЫ 
 СМОТРИ ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename