#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 sex (6) >>  sex  (6)   ( Русские man: Игры )   sex  (6)   ( Linux man: Игры ) 
   
 НАЗВАНИЕ 

sex - заняться сексом
   
 СИНТАКСИС 

 sex 

[
 options 

] ...
[
 username 

] ...
   
 ОПИСАНИЕ 

 sex 

позволяет вызывающему заняться сексом с пользователем(-ми), указанными 
в командной строке.  Если пользователи не указаны, они вызываются из 
переменной окружения 
 LOVERS .

Ниже приводятся опции, позволяющие сделать процесс более интересным:
 
 -1 

 
мастурбация
 -a 

 
дополнительный стимулятор (афродизиак)
 -b 

 
содомия
 -B<animal> 

 
скотоложество
 <животного> 

 -c 

 
шоколадный соус
 -C 

 
сковывание (шлепки включены) (см. также -m -s -W)
 -d<file> 

 
получить даты встреч, указанные в 
 <file> 

 -e 

 
эксгибиционизм (изображение отправляется на все машины в сети)
 -f 

 
предварительные ласки
 -F 

 
секс в ароматах растений
 -i 

 
прерванный половой акт (coitus interruptus) (пачкается!)
 -j 

 
джакуззи (только для сайтов в Калифорнии)
 -l 

 
кожа
 -m 

 
мазохизм (см. -s)
 -M 

 
любовь втроём (Menage a Trois)
 -n 

 
некрофилия (если целевой процесс не мёртв, программа его убивает)
 -o 

 
оральный секс
 -O 

 
параллельный доступ (оргия)
 -p 

 
отладка (пока в проекте)
 -P 

 
педофилия (нужно указать дочерний процесс)
 -q 

 
быстро (пам-бам, мерси, мадам)
 -s 

 
садизм (партнер должен быть указан с ключом -m)
 -S 

 
сливочное мороженное с сиропом и фруктами
 -T<number> 

 
секс по телефону через стандартные функции автонабора uucp;
предположительный префикс зоны - 900.
 -v 

 
вуайеризм (просмотр всей сети)
 -w 

 
взбитые сливки
 -W 

 
кнуты и хлысты (см. также -s, -C и -m)
 
 
   
 СРЕДА 

 LOVERS 

является списком партнёров по умолчанию, который используется при
отсутствии параметров в командной строке.  Если хоть один из параметров
указан, переменная
 LOVERS 

игнорируется.
   
 ФАЙЛЫ 

 

/usr/lib/sex/animals     животные для скотоложества 
 

/usr/lib/sex/blackbook   даты встреч 
 

/usr/lib/sex/sundaes     рецепты сливочного мороженного 
 

/usr/lib/sex/s&m         садо-мазохистская оснастка 
   
 ОШИБКИ 

 
 ^C 

 
(прерывание процесса) может привести к весьма неудовлетворённому 
состоянию пользователя.
 ^Z 

 
(остановка процесса) обычно сильно пачкает.
  
 
   
 АВТОР 

Автор предпочитает остаться анонимным.
   
 ИСТОРИЯ 

Самая старая программа всех времён.
   
 ПЕРЕВОД 

Перевод выполнил Алекс Попов < translator666@inbox.ru >
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СРЕДА 
 ФАЙЛЫ 
 ОШИБКИ 
 АВТОР 
 ИСТОРИЯ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename