#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 apt (8) >>  apt  (8)   ( Русские man: Команды системного администрирования )   apt  (8)   ( Linux man: Команды системного администрирования ) Ключ  apt  обнаружен в базе ключевых слов. 
   
 НАЗВАНИЕ 

apt - Продвинутый инструмент управления пакетами
   
 СИНТАКСИС 

 apt 
   
 ОПИСАНИЕ 

APT - это система управления пакетами программного обеспечения. Она находится в стадии разработки; высокоуровневой оболочки пока нет. В данный момент, пожалуйста смотрите  apt-get (8) .
   
 ОПЦИИ 

Нет.
   
 ФАЙЛЫ 

Нет.
   
 СМОТРИ ТАКЖЕ 

 apt-cache (8) ,  apt-get (8) ,  sources.list (5) 
   
 ДИАГНОСТИКА 

 apt  возвращает ноль при обычной работе и десятичную 100 при ошибке.
   
 ОШИБКИ 

Эта man-страница даже ещё не начата.
 

Смотрите < http://www.debian.org/Bugs/db/pa/lapt.html >. Если вы хотите отправить сообщение об ошибке в  apt , пожалуйста, смотрите  /usr/doc/debian/bug-reporting.txt  или команду  bug (1) . Если вы используете систему базирующуюся на RPM, то в этом случае, пожалуйста, воспользуйтесь  http://distro.conectiva.com.br  /bugzilla/.
   
 АВТОР 

 apt  была написана командой APT < apt@packages.debian.org > и портирован на системы базирующиеся на RPM Alfredo K. Kojima, < kojima@conectiva.com.br  >, из Conectiva S.A.
   
 ПЕРЕВОД 

Перевод с английского сделал Виктор Вислобоков < victor_v@permonline.ru >
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ОПЦИИ 
 ФАЙЛЫ 
 СМОТРИ ТАКЖЕ 
 ДИАГНОСТИКА 
 ОШИБКИ 
 АВТОР 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename