#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 detectloader (8) >>  detectloader  (8)   ( Русские man: Команды системного администрирования )   detectloader  (8)   ( Linux man: Команды системного администрирования ) 
   
 НАЗВАНИЕ 

detectloader - определяет, какой тип загрузчика имеется на вашем диске.
   
 ОПИСАНИЕ 

 

 detectloader  определяет тип начального загрузчика, имеющийся на вашем  MBR . Он находит первый диск посредством /proc/partitions и смотрит по магической последовательности, какой тип начального загрузчика у вас установлен.
   
 ОГРАНИЧЕНИЕ 

 

Поддерживаются только grub, lilo и yaboot (начальные загрузчики, используюемые в  Linux Mandrake ). Приветствуются патчи для других начальных загрузчиков.
   
 COPYRIGHT 

Copyright © 1999/2000 MandrakeSoft.
 

Это открытое программное обеспечение; условия копирования смотрите в исходных текстах. Ничего НЕ гарантируется; даже РАБОТОСПОСОБНОСТЬ или ПРИГОДНОСТЬ ДЛЯ ЛИЧНЫХ ЦЕЛЕЙ.
   
 ПЕРЕВОД 

Павел Марьянов < acid_jack@ukr.net >
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 ОГРАНИЧЕНИЕ 
 COPYRIGHT 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename