#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 ipcrm (8)   ipcrm  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   ipcrm  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня )   ipcrm  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   ipcrm  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня ) >>  ipcrm  (8)   ( Русские man: Команды системного администрирования )   ipcrm  (8)   ( Linux man: Команды системного администрирования ) 
 
   
 НАЗВАНИЕ 

 
ipcrm - удалить ресурс IPC
 
   
 СИНТАКСИС 

 
 ipcrm [ shm | msg | sem ]   id 
 
   
 ОПИСАНИЕ 

 
 ipcrm  удаляет ресурс IPC, указанный его дескриптором ( id ).
 
   
 СМ. ТАКЖЕ 

 
 ipcs (8) 
 
   
 АВТОР(Ы) 

 
krishna balasubramanian ( balasub@cis.ohio-state.edu )
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СМ. ТАКЖЕ 
 АВТОР(Ы) 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename