#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 iptables-save (8) >>  iptables-save  (8)   ( Русские man: Команды системного администрирования )   iptables-save  (8)   ( Linux man: Команды системного администрирования ) 


   
 ИМЯ 

iptables-save - сохранить таблицы IP
   
 ОБЗОР 

 iptables-save  [-c] [-t таблица]

 

   
 ОПИСАНИЕ 

 

 iptables-save 

используется для вывода содержимого IP таблиц (в легко обрабатываемом
формате)
на стандартный вывод. Используйте предоставляемое оболочкой перенаправление
ввода/вывода для записи в файл.
 
 -c ,  --counters 
включать в вывод текущие значения всех счетчиков байтов и пакетов.
 -t ,  --table   имя_таблицы 
ограничить вывод только одной таблицей. Если флаг не указан, будет
выведены все доступные таблицы.
 
   
 ОШИБКИ 

Ни одна не известна для iptables-1.2.1.
   
 АВТОР 

Гаральд Уэльт (Harald Welte) < laforge@gnumonks.org >
   
 СМ. ТАКЖЕ 

 iptables-restore (8),  iptables (8) 

 

iptables-HOWTO, где более детально описано использование
iptables, NAT-HOWTO, где детально описан NAT, и
netfilter-hacking-HOWTO где разъясняется внутреннее строение
iptables.
   
 ПЕРЕВОД 

Перевод с английского Виктор Ерёмин < ErV2005@rambler.ru > 2007

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 ОШИБКИ 
 АВТОР 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename