#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 nologin (8)   nologin  (4)   ( Solaris man: Специальные файлы /dev/* )   nologin  (5)   ( FreeBSD man: Форматы файлов )   nologin  (5)   ( Русские man: Форматы файлов )   nologin  (5)   ( Linux man: Форматы файлов )   nologin  (8)   ( FreeBSD man: Команды системного администрирования ) >>  nologin  (8)   ( Русские man: Команды системного администрирования )   nologin  (8)   ( Linux man: Команды системного администрирования ) 


   
 НАЗВАНИЕ 

nologin - вежливо отказывает во входе в систему
   
 СИНТАКСИС 

 
 
 nologin 
 
   
 ОПИСАНИЕ 

 

Программа
 nologin 
выдаёт сообщение, что учётная запись недоступна и завершает работу с ненулевым кодом возврата. Она предназначена для замены оболочки командной строки в поле оболочки заблокированных учётных записей.
 

Чтобы заблокировать все учётные записи посмотрите страницу руководства
 nologin (5).
   
 СМОТРИТЕ ТАКЖЕ 

 

 login (1),
 nologin (5).
   
 ИСТОРИЯ 

 

Программа
 nologin 
впервые появилась в BSD 4.4.
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 СМОТРИТЕ ТАКЖЕ 
 ИСТОРИЯ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename