#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 vzmemcheck (8) >>  vzmemcheck  (8)   ( Русские man: Команды системного администрирования ) 
   
 ИМЯ 

vzmemcheck - показывает информацию о памяти физической среды.
   
 ОБЗОР 

vzmemcheck [ -v ] [ -A ]
   
 ОПЦИИ 

 
 -v 
Выводить информацию по каждой виртуальной среде.
 -A 
Показать абсолютные значения (в мегабайтах). 
 
   
 ОПИСАНИЕ 

Эта программа показывает использование памяти физической среды:
 low memory utilization ,  low memory commitment ,  RAM utilization 
, mem+swap utilization ,  mem+swap commitment ,
 allocmem utilization ,  allocmem commitment ,  allocmem limit .

С флагом  -A  будут показаны абсолютные значения (в мегабайтах).Без
флага  -v , будут показана дополнительные строки: линия(линии) заголовка,
числитель и знаменатель соответствующей дроби.
   
 ДИАГНОСТИКА 

В случае успешного завершения возвращается 0. В случае ошибки
возвращается значение 1.
   
 АВТОРСКИЕ ПРАВА 

Copyright (C) 2000-2007, SWsoft. Распространяется на условиях лицензии GNU GPL.
   
 ПЕРЕВОД 

Перевод с английского Виктор Ерёмин < ErV2005@rambler.ru > 2007
 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПЦИИ 
 ОПИСАНИЕ 
 ДИАГНОСТИКА 
 АВТОРСКИЕ ПРАВА 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename