#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 intro (4)   intro  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   intro  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня )   intro  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   intro  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   intro  (2)   ( Solaris man: Системные вызовы )   intro  (2)   ( FreeBSD man: Системные вызовы )   intro  (2)   ( Русские man: Системные вызовы )   intro  (2)   ( Linux man: Системные вызовы )   intro  (3)   ( Solaris man: Библиотечные вызовы )   intro  (3)   ( FreeBSD man: Библиотечные вызовы )   intro  (3)   ( Русские man: Библиотечные вызовы )   intro  (3)   ( Linux man: Библиотечные вызовы )   intro  (4)   ( Solaris man: Специальные файлы /dev/* )   intro  (4)   ( FreeBSD man: Специальные файлы /dev/* ) >>  intro  (4)   ( Русские man: Специальные файлы /dev/* )   intro  (4)   ( Linux man: Специальные файлы /dev/* )   intro  (5)   ( Solaris man: Форматы файлов )   intro  (5)   ( FreeBSD man: Форматы файлов )   intro  (5)   ( Русские man: Форматы файлов )   intro  (5)   ( Linux man: Форматы файлов )   intro  (6)   ( Solaris man: Игры )   intro  (6)   ( Русские man: Игры )   intro  (6)   ( Linux man: Игры )   intro  (7)   ( Solaris man: Макропакеты и соглашения )   intro  (7)   ( FreeBSD man: Макропакеты и соглашения )   intro  (7)   ( Русские man: Макропакеты и соглашения )   intro  (7)   ( Linux man: Макропакеты и соглашения )   intro  (8)   ( FreeBSD man: Команды системного администрирования )   intro  (8)   ( Русские man: Команды системного администрирования )   intro  (8)   ( Linux man: Команды системного администрирования )   intro  (9)   ( FreeBSD man: Ядро )   intro  (9)   ( Linux man: Ядро ) 
   
 НАЗВАНИЕ 

intro - введение в специальные файлы
   
 ОПИСАНИЕ 

Эта глава описывает специальные файлы.
   
 ФАЙЛЫ 

/dev/* --- файлы устройств
   
 АВТОРЫ 

Имена авторов каждой страницы можно увидеть в комментариях внутри текста.
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 ФАЙЛЫ 
 АВТОРЫ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename