#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 comm (1)   comm  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   comm  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  comm  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   comm  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   comm  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

comm - построчно сравнивает два файла
   
 ОБЗОР 

 comm 

[ ОПЦИИ ]...  ФАЙЛ1 ФАЙЛ2 
   
 ОПИСАНИЕ 


 

Сравнивает сортированные файлы ФАЙЛ1 и ФАЙЛ2 построчно.
 

Команда, запущенная без опций, выводит три столбца. Первый столбец содержит строки,
уникальные для ФАЙЛА1, второй столбец - строки, уникальные для ФАЙЛА2,
третий столбец содержит общие для обоих файлов строки.
 
 -1 
не отображать строки, уникальные для ФАЙЛА1
 -2 
не отображать строки, уникальные для ФАЙЛА2
 -3 
не отображать общие для обоих файлов строки
 --help 
отображение этой справки
 --version 
вывод информации о версии
 
   
 АВТОР 

Программу написал Richard Stallman и David MacKenzie.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Об ошибках сообщайте по адресу < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

Полная документация по
 comm 

доступна в формате Texinfo. Если программы
 info 

и
 comm 

установлены и настроены в системе, то по команде
 
 
 info comm 

 
 

вы получите доступ к полному руководству.
   
 ПЕРЕВОД 

Перевод с английского Сергей В. Миронов < sergo@bk.ru > 2007

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 АВТОР 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename