#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 dirname (1)   dirname  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   dirname  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  dirname  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   dirname  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   dirname  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   dirname  (3)   ( Solaris man: Библиотечные вызовы )   dirname  (3)   ( FreeBSD man: Библиотечные вызовы )   dirname  (3)   ( Русские man: Библиотечные вызовы )   dirname  (3)   ( Linux man: Библиотечные вызовы )   dirname  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 ИМЯ 

dirname - убирает имя файла из указанного пути (оставляет только имя каталога) 
   
 ОБЗОР 

 dirname 

 ПУТЬ 
 

 dirname 

 ОПЦИЯ 
   
 ОПИСАНИЕ 


 

Выводит имя каталога из заданного ПУТИ без завершающего символа "/". Если ПУТЬ не содержит символов "/",
выводит символ "." (что означает текущий каталог).
 
 --help 
вывести справку и закончить работу
 --version 
вывести информацию о версии и закончить работу
 
   
 ПРИМЕРЫ 

 
 dirname /usr/bin/sort 
Выводит "/usr/bin".
 dirname stdio.h 
Выводит ".".
 
   
 АВТОРЫ 

Программа написана MacKenzie и Jim Meyering.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Об ошибках сообщайте по адресу < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

Полная документация по
 dirname 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 dirname 

установлены и настроены в системе, то по команде
 
 
 info dirname 

 
 

вы получите доступ к более полному руководству.
   
 ПЕРЕВОД 

Сергеева Мария < mvsergeeva@yandex.ru > 2007

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 ПРИМЕРЫ 
 АВТОРЫ 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename