#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 eshowkw (1) >>  eshowkw  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    eshowkw ¶ 


	 НАЗВАНИЕ ¶ 


eshowkw - Gentoo: утилита для работы с ключевыми словами пакетов 

	 СИНТАКСИС ¶ 


	 eshowkw  [ОПЦИИ] [--] [пакет [пакет ...]] 


	 ОПИСАНИЕ ¶ 


	 Выводит ключевые слова для пакета (-ов), указанного (-ых) в аргументе или для пакета, расположенного в текущем рабочем каталоге. 


	 ОПЦИИ ¶ 


	 package 


	 Проверяемые пакеты. (По умолчанию будут обрабатываться обрабатываться ебилды в текущем каталоге.) 


	 -h | --help 


	 Вывести информацию о синтаксисе утилиты. 


	 -v | --version 


	 Вывести версию утилиты и выйти. 


	 -a=АРХИТЕКТУРА[,АРХИТЕКТУРА ...] | --arch=АРХИТЕКТУРА[,АРХИТЕКТУРА ...] 


	 Фильтровать по указанной архитектуре, исключая остальные. 


	 -A {top,bottom} | --align {top,bottom} 


	 Указать тип выравнивания описаний. (По умолчанию - по нижнему краю (bottom).) 


	 -T {archlist,versionlist} | --top-position {archlist,versionlist} 


	 Указать поля, которые должны присутствовать в верхнем листинге. (По умолчанию - archlist.) 


	 -B | --bold 


	 Отображать колонки через одну жирным шрифтом, для удобства восприятия. (По умолчанию - нет (False).) 


	 -C | --color 


	 Принудительно использовать цветной вывод (По умолчанию - нет (False).) 


	 -O | --overlays 


	 Искать в оверлеях. (По умолчанию - нет (False).) 


	 -P | --prefix 


	 Включать в вывод префиксные ключевые слова. (По умолчанию - нет (False).) 


	 -S | --ignore-slot 


	 При выявлении избыточных пакетов не принимать во внимание слоты. (По умолчанию - нет (False).) 


	 ОШИБКИ ¶ 


	 Об обнаруженных ошибках сообщайте на < http://bugs.gentoo.org> . 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename