#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 FvwmBanner (1)   FvwmBanner  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня ) >>  FvwmBanner  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
 
   
 НАЗВАНИЕ 

 
 FvwmBanner  - модуль вывода заставок
 
   
 СИНТАКСИС 

 
 FvwmBanner  вызывается оконным менеджером fvwm.
 
   
 ОПИСАНИЕ 

 
 FvwmInitBanner  показывает логотип Fvwm в центре экрана в
течение 3 секунд.
 
   
 ПРАВА 

 
Отсутствуют.
 
   
 Инициализация 

 
Ничего интересного.
 
   
 Вызов 

 
 FvwmBanner  может быть вызван строкой  `Module FvwmBanner' 
из меню или в секции инициализации файла  .fvwmrc.  Fvwm
ищет  FvwmBanner  в каталоге, определенном параметром  ModulePath. 
Хотя и не требуется задавать каких-либо
параметров для запуска  FvwmBacker , но можно дать
необязательный параметр - имя файла, например  `FvwmBanner
doomface.xpm'  или задать другой .xpm файл через
параметры конфигурации.
 
   
 Параметры конфигурации 

 
 
 *FvwmBannerPixmap файл 
 
Заставляет модуль показать  файл  вместо встроенной
заставки.
 
 *FvwmBannerTimeout секунды 
 
Заставляет модуль показывать заставку указанное число секунд
вместо 3-х по умолчанию.
 
 
   
 АВТОР(Ы) 

 
Robert Nation
 
Перевел с английского Виктор Вислобоков
(2:5054/ 8.34@Fidonet.org )
 
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ПРАВА 
 Инициализация 
 Вызов 
 Параметры конфигурации 
 АВТОР(Ы) 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename