#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 paste (1)   paste  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   paste  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  paste  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   paste  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   paste  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

paste - объединить строки файлов.
   
 ОБЗОР 

 paste 

[ ОПЦИЯ ]... [ ФАЙЛ ]...
   
 ОПИСАНИЕ 


 

Выводить на стандартный вывод строки, состоящие из соответствующих строк
каждого ФАЙЛА, разделенных символом табуляции.
Если ФАЙЛ не задан, или если ФАЙЛ задан как -, то чтение данных будет
происходить из стандартного ввода.
 

Обязательные аргументы для длинных опций обязательны и для сокращённых опций.
 
 -d ,  --delimiters = СПИСОК 
использовать символы из СПИСКА вместо символа табуляции
 -s ,  --serial 
вставлять один файл за раз, а не параллельно с другим
 --help 
Вывести справку и выйти
 --version 
Вывести информацию о версии и выйти
 
   
 АВТОРЫ 

David M. Ihnat и David MacKenzie.
   
 СООБЩЕНИЯ ОБ ОШИБКАХ 

Об ошибках сообщайте на < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

Полная документация по
 paste 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 paste 

установлены и настроены в системе, то по команде
 
 
 info paste 

 
 

вы получите доступ к более полному руководству.
   
 ПЕРЕВОД 

Перевод с английского Alexander Kolotov < alexandr.kolotov@gmail.com > 2007
 
 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 АВТОРЫ 
 СООБЩЕНИЯ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename