#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 pcnfsd (1) >>  pcnfsd  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
 
 
 pcnfsd(1M) 
 (NFS) 
 pcnfsd(1M) 
 
 

 НАЗВАНИЕ 
 pcnfsd  - демон NFS для аутентификации пользователей PC-NFS и удаленной 
печати 

 СИНТАКСИС 
 
	/usr/lib/nfs/pcnfsd
 

 ОПИСАНИЕ 
 Команда  pcnfsd  запускает демон, обрабатывающий запросы на аутентификацию 
пользователей PC-NFS и удаленную печать от клиентских машин, работающих 
под DOS, Windows и Windows NT. Демон  pcnfsd  поддерживает клиентов, 
использующих PC-NFS до версии 5.0 включительно. 

 ИСПОЛЬЗОВАНИЕ 
 Команда  pcnfsd  не имеет опций. 

 Демон  pcnfsd  автоматически запускается на уровне выполнения 3. 

 Только привилегированный пользователь может выполнять эту команду. 

 ССЫЛКИ 
 
	 nfsping(1M) 
	См. документацию, поставляемую вместе с программным обеспечением PC-NFS.
 

 Copyright 1994 Novell, Inc. 
Copyright 1999  В. Кравчук ,
 OpenXS Initiative , перевод на русский язык
 

 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename