#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qcheck (1) >>  qcheck  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    qcheck ¶ 


	 НАЗВАНИЕ ¶ 


qcheck - проверка целостности установленного пакета 

	 СИНТАКСИС ¶ 


	 qcheck   <опции> <пакет> 


	 ОПИСАНИЕ ¶ 


	 Допустимые опции:  -[eauAHTBvqChV] 


	 -e ,  --exact 


	 * Точное совпадение (только CAT/PN или PN без PV) 


	 -a ,  --all 


	 * Вывести все пакеты 


	 -u ,  --update 


	 * Обновить данные об отсутствующих файлах, контрольных суммах и времени последнего изменения пакетов 


	 -A ,  --noafk 


	 * Игнорировать отсутствующие файлы 


	 -H ,  --nohash 


	 * Игнорировать отличия/отсутствие контрольной суммы 


	 -T ,  --nomtime 


	 * Игнорировать отличия во времени последнего изменения файлов 


	 -B ,  --badonly 


	 * Выводить только пакеты, содержащие битые файлы, исключая /etc. 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qcheck.1,v 1.24 2008/04/12 17:26:00 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Апрель 2008 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename