#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qlop (1) >>  qlop  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    qlop ¶ 


	 НАЗВАНИЕ ¶ 


qlop - анализатор журналов установки 

	 СИНТАКСИС ¶ 


	 qlop   <опции> <пакет> 


	 ОПИСАНИЕ ¶ 


	 Доступные опции:  -[gtHluscf:vqChV] 


	 -g ,  --gauge 


	 * Определить, сколько раз устанавливался пакет 


	 -t ,  --time 


	 * Рассчитать среднее время установки пакета 


	 -H ,  --human 


	 * Выводить секунды в удобном для восприятия виде (требует опции  -t ) 


	 -l ,  --list 


	 * Показывать историю установок 


	 -u ,  --unlist 


	 * Показывать историю удалений 


	 -s ,  --sync 


	 * Показывать историю синхронизаций 


	 -c ,  --current 


	 * Показывать, какие пакеты сейчас устанавливаются 


	 -f ,  --logfile  <аргумент> 


	  * Обращаться к журналу emerge вместо /var/log/emerge.log 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qlop.1,v 1.20 2007/05/11 08:25:06 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Май 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename