#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 qsize (1) >>  qsize  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   qsize  (9)   ( Solaris man: Ядро ) 
    qsize ¶ 


	 НАЗВАНИЕ ¶ 


qsize - данные по размеру пакетов 

	 СИНТАКСИС ¶ 


	 qsize   <опции> <пакет> 


	 ОПИСАНИЕ ¶ 


	 Доступные опции:  -[fasSmkbi:vqChV] 


	 -f ,  --filesystem 


	 * Показать объем занятого пространства на диске 


	 -a ,  --all 


	 * Определить размер всех установленных пакетов 


	 -s ,  --sum 


	 * Включить в вывод сводные данные 


	 -S ,  --sum-only 


	 * Показать только сводные данные 


	 -m ,  --megabytes 


	 * Выводить размер в мегабайтах 


	 -k ,  --kilobytes 


	 * Выводить размер в килобайтах 


	 -b ,  --bytes 


	 * Выводить размер в байтах 


	 -i ,  --ignore  <аргумент> 


	 * Игнорировать строку шаблона 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: qsize.1,v 1.22 2007/06/07 18:27:00 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Июнь 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename