#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 quse (1) >>  quse  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
    quse ¶ 


	 НАЗВАНИЕ ¶ 


quse - узнать, какие пакеты используют USE-флаг 

	 СИНТАКСИС ¶ 


	 quse   <опции> <use-флаг> 


	 ОПИСАНИЕ ¶ 


	 Допустимые опции:  -[eavKLDF:NvqChV] 


	 -e ,  --exact 


	 * Вместо поиска по шаблону показывать точное соответствие, найденное с помощью функции strcmp 


	 -a ,  --all 


	 * Выводить все данные IUSE 


	 -K ,  --keywords 


	 * Использовать KEYWORDS вместо IUSE 


	 -L ,  --license 


	 * Использовать LICENSE вместо IUSE 


	 -D ,  --describe 


	 * Описать USE-флаг 


	 -F ,  --format  <аргумент> 


	 * Использовать собственный формат переменных. -F NAME= 


	 -N ,  --name-only 


	 * Отображать только название пакета 


	 -v ,  --verbose 


	 * Предлагать подробный вывод 


	 -q ,  --quiet 


	 * Предлагать компактный вывод - в частности, не выводить предупреждения 


	 -C ,  --nocolor 


	 * Не использовать цветной вывод 


	 -h ,  --help 


	 * Вывести эту справку и выйти 


	 -V ,  --version 


	 * Вывести версию программы и выйти 


	 $Id: quse.1,v 1.22 2007/05/11 08:25:06 solar Exp $ 


	 ПЕРЕВОД ¶ 


	 
	 Елена Гаврилова < e.vl.gavrilova@yandex.ru > 
	 


	     


	 Май 2007 







 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename