#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 readlink (1)   readlink  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   readlink  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  readlink  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   readlink  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   readlink  (2)   ( Solaris man: Системные вызовы )   readlink  (2)   ( FreeBSD man: Системные вызовы )   readlink  (2)   ( Русские man: Системные вызовы )   readlink  (2)   ( Linux man: Системные вызовы )   readlink  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 ИМЯ 

readlink - вывести значение символической ссылки
   
 ОБЗОР 

 readlink 

[ ОПЦИИ ]...  ФАЙЛ 
   
 ОПИСАНИЕ 


 

Вывести значение символической ссылки на стандартный вывод.
 
 -f ,  --canonicalize 
получить каноническое имя файла путем
рекурсивного следования по всем символьным
ссылкам в каждом компоненте заданного пути;
все компоненты пути, кроме последнего,
должны существовать
 -e ,  --canonicalize-existing 
получить каноническое имя файла путем
рекурсивного следования по всем символьным
ссылкам в каждом компоненте заданного пути;
все компоненты пути должны существовать
 -m ,  --canonicalize-missing 
получить каноническое имя файла путем
рекурсивного следования по всем символьным
ссылкам в каждом компоненте заданного пути;
компоненты пути не обязаны существовать
 -n ,  --no-newline 
не выводить завершающий символ новой строки
 
 -q ,  --quiet ,
 -s ,  --silent 
подавлять большинство сообщений об ошибках
 -v ,  --verbose 
выводить сообщения об ошибках
 --help 
вывести справку и закончить работу
 --version 
вывести информацию о версии и закончить работу
 
   
 АВТОР 

Дмитрий Левин.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Об ошибках сообщайте по адресу < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

 Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

Более полное описание
 readlink 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 readlink 

установлены и настроены в системе, то по команде
 
 
 info readlink 

 
 

вы получите доступ к полному руководству.
   
 ПЕРЕВОД 

Перевод с английского Alexander Kolotov < alexandr.kolotov@gmail.com > 2007
 
 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 АВТОР 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename