#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 unexpand (1)   unexpand  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   unexpand  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  unexpand  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   unexpand  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   unexpand  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

unexpand - преобразовать пробелы в символы табуляции
   
 ОБЗОР 

 unexpand 

[ ОПЦИЯ ]... [ ФАЙЛ ]...
   
 ОПИСАНИЕ 


 

В каждом ФАЙЛЕ преобразовать пробелы в символы табуляции, выводя
результат на стандартный вывод.
Если не указано никакого ФАЙЛА или ФАЙЛ задан как -, то читать данные со
стандартного ввода.
 

Обязательные аргументы для длинных опций обязательны и для сокращённых опций.
 
 -a ,  --all 
преобразовывать все пробелы, а не только пробелы в начале строк
 
 --first-only  преобразовывать пробелы только в начале
строк (перекрывает  -a )
 -t ,  --tabs = N 
символы табуляции отделяют друг от друга N символов, а
не 8 (включает  -a )
 -t ,  --tabs = СПИСОК 
использовать СПИСОК, разделенный запятыми, описывающий позиции
символов табуляции (включает  -a )
 --help 
Вывести справку и выйти
 --version 
Вывести информацию о версии и выйти
 
   
 АВТОР 

 David MacKenzie.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Сообщайте о всех найденных ошибках на < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

 unexpand (1)
 

Полная документация по
 unexpand 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 unexpand 

установлены и настроены в системе, то по команде
 
 
 info unexpand 

 
 

вы получите доступ к более полному руководству.
   
 ПЕРЕВОД 

Перевод с английского Alexander Kolotov < alexandr.kolotov@gmail.com > 2007
 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 АВТОР 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename