#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 unlink (1)   unlink  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  unlink  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   unlink  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   unlink  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня )   unlink  (2)   ( Solaris man: Системные вызовы )   unlink  (2)   ( FreeBSD man: Системные вызовы )   unlink  (2)   ( Русские man: Системные вызовы )   unlink  (2)   ( Linux man: Системные вызовы )   unlink  (3)   ( Solaris man: Библиотечные вызовы )   unlink  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 ИМЯ 

unlink - удаляет файл с помощью системной функции unlink
   
 ОБЗОР 

 unlink 

 ФАЙЛ 
 

 unlink 

 ОПЦИЯ 
   
 ОПИСАНИЕ 


 

Удаляет ФАЙЛ с помощью системной функции unlink.
 
 --help 
вывести справку и закончить работу
 --version 
вывести информацию о версии и закончить работу
 
   
 АВТОР 

Michael Stone.
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Сообщайте о всех найденных ошибках на < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

Полная документация по
 unlink 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 unlink 

установлены и настроены в системе, то по команде
 
 
 info unlink 

 
 

вы получите доступ к более полному руководству.
   
 ПЕРЕВОД 

Николай Шафоростов < shafff@ukr.net > 2007
 

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 АВТОР 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename