#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 usleep (1) >>  usleep  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   usleep  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   usleep  (3)   ( Solaris man: Библиотечные вызовы )   usleep  (3)   ( FreeBSD man: Библиотечные вызовы )   usleep  (3)   ( Русские man: Библиотечные вызовы )   usleep  (3)   ( Linux man: Библиотечные вызовы )   usleep  (3)   ( POSIX man: Библиотечные вызовы ) 
   
 НАЗВАНИЕ 

usleep - засыпает на заданное количество микросекунд
   
 СИНТАКСИС 

 usleep 

[ число ]
   
 ОПИСАНИЕ 

 usleep 

спит заданное число микросекунд. Значение по умолчанию - 1.
   
 ОПЦИИ 

 --usage 
Выводит краткую информацию по использованию.
 
 --help, -? 
Выводит справку о программе.
 -v, --version 
Выводит номер версии.
 
   
 НАЙДЕННЫЕ ОШИБКИ 

На многих машинах вероятен не совсем точный обсчет чисел около
микросекунды. Рассчитывайте на точность только в разрядах -4 или -5.
   
 АВТОРЫ 

Donald Barnes < djb@redhat.com >
 

Erik Troan < ewt@redhat.com >
 

 
   Index 
 
 НАЗВАНИЕ 
 СИНТАКСИС 
 ОПИСАНИЕ 
 ОПЦИИ 
 НАЙДЕННЫЕ ОШИБКИ 
 АВТОРЫ 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename