#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 wc (1)   wc  (1)   ( Solaris man: Команды и прикладные программы пользовательского уровня )   wc  (1)   ( FreeBSD man: Команды и прикладные программы пользовательского уровня ) >>  wc  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня )   wc  (1)   ( Linux man: Команды и прикладные программы пользовательского уровня )   wc  (1)   ( POSIX man: Команды и прикладные программы пользовательского уровня ) 
   
 ИМЯ 

wc - печатает число строк, слов и байт в файлах
   
 ОБЗОР 

 wc 

[ ОПЦИЯ ]... [ ФАЙЛ ]...
   
 ОПИСАНИЕ 


 

Печатает число переводов строк, слов и байт для каждого ФАЙЛА и
итоговую строку, если было задано несколько ФАЙЛОВ.  Если ФАЙЛ не
задан или задан как -, читает стандартный ввод.
 
 -c ,  --bytes 
печать числа байтов
 -m ,  --chars 
печать числа символов
 -l ,  --lines 
печать числа строк
 -L ,  --max-line-length 
печать количества символов в самой длинной строке
 -w ,  --words 
печать количества слов
 --help 
вывести справку и закончить работу
 --version 
вывести информацию о версии и закончить работу
 
   
 АВТОРЫ 

Программа написана Paul Rubin и David MacKenzie
   
 СООБЩЕНИЕ ОБ ОШИБКАХ 

Об ошибках сообщайте по адресу < bug-coreutils@gnu.org >.
   
 АВТОРСКИЕ ПРАВА 

Copyright © 2006 Free Software Foundation, Inc.
 

Это свободное программное обеспечение. 
Вы можете распространять его копии при соблюдении условий
GNU General Public License < http://www.gnu.org/licenses/gpl.html >.
Не предоставляется НИКАКИХ ГАРАНТИЙ в установленных законом пределах.
   
 СМ. ТАКЖЕ 

Полная документация по
 wc 

поддерживается в виде руководства в формате Texinfo. Если программы
 info 

и
 wc 

установлены и настроены в системе, то по команде
 
 
 info wc 

 
 

вы получите доступ к более полному руководству.
   
 ПЕРЕВОД 

Сергеева Мария < mvsergeeva@yandex.ru > 2007

 
   Index 
 
 ИМЯ 
 ОБЗОР 
 ОПИСАНИЕ 
 АВТОРЫ 
 СООБЩЕНИЕ ОБ ОШИБКАХ 
 АВТОРСКИЕ ПРАВА 
 СМ. ТАКЖЕ 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename