#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 xf86config (1) >>  xf86config  (1)   ( Русские man: Команды и прикладные программы пользовательского уровня ) 
   
 NAME 
 xf86config - программа для создания файла XF86Config
   
 SYNOPSIS 

 xf86config 

   
 ОПИСАНИЕ 

 xf86config  это интерактивная программа для создания файла XF86Config, 
который определяет конфигурацию X-серверов в XFree86.
   
 ФАЙЛЫ 

<xroot>/lib/X11/Cards            база данных о видеокартах
   
 СМОТРИ ТАКЖЕ 

 XFree86 (1), XF86Config(4/5),  reconfig (1)
   
 АВТОР 

Harm Hanemaayer.

   
 ПЕРЕВОД 

данной man-страницы на русский язык выполнен В.А.Костроминым 26.01.2000 г.
 

 
   Index 
 
 NAME 
 SYNOPSIS 
 ОПИСАНИЕ 
 ФАЙЛЫ 
 СМОТРИ ТАКЖЕ 
 АВТОР 
 ПЕРЕВОД 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename