#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 drake (6) >>  drake  (6)   ( Русские man: Игры ) 
   
 NAME 
 Дрейк, Фрэнсис  (1543-1596) - известный английский пират, флотоводец
и мореплаватель
   
 DESCRIPTION 

Шестнадцатое столетие - это время прославленных плаваний целой плеяды
знаменитых английских капитанов, эпоха зарождения гегемонии британского
флота в Мировом океане.
 

Фробишер и Хокинс, Рэли и
Девис, Дрейк и Кавендиш и много других
блестящих навигаторов бороздили в эти годы волны Северной Атлантики и
Карибского бассейна, Индийского океана и Полинезии.
 

Увы, эта пора была одновременно эпохой расцвета пиратского промысла, и
все перечисленные здесь мореходы прославились в первую очередь как
"джентльмены удачи".
 

Самым известным из них и, наверное, вообще самым знаменитым англичанином
в XVI веке был сэр Френсис Дрейк - пират и работорговец, кругосветный
мореплаватель и талантливый флотоводец, сыгравший решающую роль в
разгроме испанской "Непобедимой Армады".
 

Близкий родственник прославленного пирата и торговца "живым товаром"
Джона Хокинса, он с 23 лет плавал на его кораблях к берегам Африки, а
оттуда с трюмами, полными невольников, в страны Карибского моря.
 

Затем Дрейк уже самостоятельно занялся пиратским ремеслом у берегов
Панамы. Так, в разбойничьих трудах и заботах, пролетело 12 лет, за
которые капитан Дрейк накопил немалый мореходный опыт и кое-какой
капитал, что позволило ему предложить королеве и ее приближенным дерзкий
проект пиратской экспедиции в испанские колонии на тихоокеанском
побережье Америки.
 

Здесь никто не ожидал нападения англичан, и добыча могла быть
значительно больше, чем в порядком ощипанных пиратами портах Карибского
моря.
 

Королева Елизавета благосклонно отнеслась к планам Дрейка и даже
соизволила внести свою лепту в финансовое обеспечение экспедиции в
размере... тысячи крон. Более весомый вклад сделали высокопоставленные
королевские чиновники: граф Эссекс, Уолсингем и Берли. Впрочем,
досточтимые лорды надеялись не остаться внакладе и действительно не
просчитались. По возвращении Дрейка они получили свою долю добычи, и
прибыль их составила 5~000 процентов на вложенный капитал.
 

Но до этого было еще далеко, а пока, в декабре 1577 года, пять кораблей
флотилии Дрейка вышли из порта Плимут курсом на юг. Сам Дрейк плыл на
флагманском судне "Пеликан", позднее переименованном им в "Золотую
лань". Экипаж всей флотилии составлял 160 человек. Поразбойничав для
начала у африканских берегов, Дрейк захватил и ограбил больше десятка
испанских и португальских кораблей с богатым грузом. Кроме того, на
одном из них в его руки попалась и более ценная добыча - португальский
лоцман, плававший ранее в Южную Америку.
 

В июне 1578 года флотилия Дрейка подошла к бухте Сан-Хулиан,
находящейся на подступах к Магелланову проливу. Бухта эта, печально
известная бунтом, случившимся во время стоянки здесь экспедиции
Магеллана, и на этот раз оправдала свою дурную славу.
 

Конфликт, происшедший в экипаже, кончился тем, что Дрейк казнил одного
из капитанов, Доути, обвинив его в подстрекательстве к мятежу и
предательстве. Оставив в бухте два сильно поврежденных корабля,
поредевшая флотилия двинулась дальше. Но на выходе из Магелланова
пролива сильнейший шторм обрушился на корабли и 50 дней гнал их на юг. В
результате Дрейк обнаружил, что Огненная Земля - остров, а не выступ
Южного материка, как считалось до этого. Широкий пролив, отделяющий этот
остров от Антарктиды, носит ныне имя Дрейка.
 

Шторм нанес флотилии серьезный урон: один корабль утонул, а другой из-за
повреждений вынужден был вернуться в Англию. Однако Дрейк не любил
отступать. На единственном оставшемся корабле - "Золотой Лани" - он
направился на север, к побережью Чили. Дальше начинается полоса активных
и удачных пиратских похождений. 5 декабря 1579 года - нападение на порт
Вальпараисо. Захвачен корабль с ценным грузом и ограблен город. 5
февраля 1579 года - налет на порт Арика и новые трофеи. Затем -
нападение на перуанский город Кальяо, где из-под носа Дрейка уходит
галион с грузом золота и серебра. Следует яростная погоня, и 1 марта
галион захвачен после пушечного обстрела. Драгоценные слитки
перекочевывают в трюм "Золотой Лани".
 

Теперь задачи пиратской экспедиции можно было считать выполненными. Но
возвращение домой прежним путем стало невозможным. За 4 месяца грабежей
слухи о них дошли до испанских властей, и военные корабли Испании
караулили "Золотую Лань", чтобы расквитаться с пиратами за все их
злодеяния.
 

Тогда Дрейк уходит  на север, нападает на мексиканский порт
Гуатулко и грабит его, заодно пополнив запас провианта. Затем он ведет
корабль еще севернее, надеясь найти пролив, соединяющий Тихий океан с
Атлантикой. Корабль английского пирата доходит до 49-го градуса северной
широты - так далеко на север вдоль тихоокеанского побережья не забирался
еще ни один мореплаватель! Но никаких признаков пролива обнаружить не
удается, и Дрейк вынужден повернуть к югу.
 

И тут ему улыбается удача. У берегов Никарагуа англичане захватывают
корабль, на котором находят карты Тихого океана и Филиппинских островов.
Это подсказывает Дрейку идею вернуться в Европу через Тихий и Индийский
океаны.
 

В июле 1579 года "Золотая лань" берет курс на запад. Сделав лишь четыре
остановки в пути (на Филиппинах, Молуккском архипелаге, острове Ява и в
Сьерра-Леоне), Дрейк с триумфом возвращается в Англию.
 

Через 60 лет после плавания Магеллана еще один корабль
обогнул земной шар. Причем Дрейк стал первым капитаном, который от
начала до конца командовал кораблем в кругосветном плавании.
 

Но для встречавших в Плимуте "Золотую лань" сановников главным было не
это. Корабль Дрейка привез золота и драгоценностей на сумму, равную
двухгодичному доходу всей королевской казны! Королева приказала своему
капитану лично прибыть в Лондон с наиболее эффектными драгоценностями и
удостоила его шестичасовой беседы. Вскоре Елизавета возвела Дрейка в
рыцарское достоинство. Став дворянином, разбойник и грабитель сделался
уважаемым членом общества. Он купил себе поместье и женился на богатой
наследнице. Дрейка выбрали мэром Плимута и членом парламента.
 

Однако спокойная жизнь была моряку не по душе. Он организовал еще две
пиратские экспедиции в Карибское море, а в промежутке между ними успел
  принять участие в войне с Испанией. Сэру Френсису Дрейку, назначенному
вице-адмиралом  британского флота,  принадлежит главная заслуга в
победном сражении с "Непобедимой Армадой" испанцев, которые имели
двойной перевес в числе кораблей и пушек по сравнению с англичанами.
 

Что же касается пиратских рейдов, то они больше не приносили Дрейку
удачи. Во втором плавании к берегам Панамы он заболел дизентерией и
скончался на борту своего корабля. Как и положено у моряков, его
похоронили в море, том самом Карибском море, которое было свидетелем
первых подвигов знаменитого английского "джентльмена удачи".
   
 AUTHOR 

Б.Б. Вагнер < bert@wagner.rinet.ru >
   
 SEE ALSO 

Книгу Б.Б. Вагнера "Путями великих мореплавателей", М.:"Флинта", 1999
 

 
   Index 
 
 NAME 
 DESCRIPTION 
 AUTHOR 
 SEE ALSO 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename