#!/bin/bash

#. "$HOME/.bashrc"

filename="$HOME/"

echo -e "${HLIGHT}---start file: $filename---${NORMAL}" # start file

#---------------------------------------
:<<end_of_comments


 
 
 
 
 
Профиль:  Аноним  ( вход  |  регистрация ) 

 
 
 
 
 
 

 
 
 
 
  НОВОСТИ  ( + )
 
   КОНТЕНТ 
 
   WIKI 
 
    MAN'ы 
 
    ФОРУМ 
 
 Поиск  ( теги )
 
 
 

 

           
 
 

 
 
 
 
 
 
 
 [  новости  / +++  |  форум  |  wiki  |  теги 
|  
] 
 
 
 
 


 
 
 
 
 
 
 
 
 
 

 Интерактивная система просмотра системных руководств (man-ов) 
  
 
 
 

 
   Тема Набор Категория   
 

  
 Solaris man
 FreeBSD man
 Разные man
 Русские man
 Linux man
 POSIX man
 
 
	   All
	   1
	   2
	   3
	   4
	   5
	   6
	   7
	   8
	   9
 

 
 
  [ Cписок руководств  |  Печать ] 
 
 
 
 hex-a-hop (6) >>  hex-a-hop  (6)   ( Русские man: Игры ) 
   
 НАЗВАНИЕ 

hex-a-hop - игра-головоломка с шестиугольными плитками
   
 ОПИСАНИЕ 

Hex-a-hop --- это игра-головоломка с шестиугольными
плитками. Здесь нет ограничений по времени и элементов аркады.
 
Целью игры является уничтожение всех зелёных шестиугольных плиток на 100
уровнях. По мере прохождения игры появляются плитки с разными свойствами,
что делает прохождение сложнее и интереснее.
 
   
 ИСПОЛЬЗОВАНИЕ 

Вы можете перемещать персонажа игры с помощью клавиш Q,W,E,A,S,D или
числовой клавиатуры. Также можно использовать мышь и щёлкать по плитке, на
которую нужно переместиться.
 
Чтобы вернуться назад при неверном ходе нажмите 'U', backspace или правую
клавишу мыши. По клавише 'Esc' (или средней кнопке мыши) появляется меню,
откуда можно начать заново, если ничего не получается.
 
Ваша цель --- сломать все зелёные плитки. Для этого в большинстве случаев
нужно прыгнуть на них. Он трескаются, если на них наступить и сломаются
окончательно, когда вы с них спрыгните. Не загоните сами себя в ловушку!
 
Во время игры вам будут даваться подсказки и инструкции что делать. Для
пролистывания страниц помощи используются клавиши курсора или можно щёлкать
мышкой по стрелкам. По мере прохождения игры количество страниц будет
увеличиваться, так как будут появляться новые типы плиток.
 
На экране с картой вы можете выбрать следующий уровень для
прохождения. Серебристым цветом отмечены пройденные уровни. Чёрным цветом
отмечены не пройденные и доступные для игры.
 
Ограничений по времени и элементов аркады нет, поэтому играть каждый уровень
можно долго.
   
 СМОТРИТЕ ТАКЖЕ 

Информация об игре представлена на её домашней странице:
 http://www.aceinternet.co.uk/~mokona/ 
 
В версии Debian информация о пройденных уровнях хранится в каталоге
$HOME/.hex-a-hop/. Если переменная окружения $HOME не установлена, то для
этой цели используется каталог /tmp/.
 
   
 АВТОР 

Игра была написана Томом Бомоном (Tom Beaumont) и распространяется под
лицензией GNU General Public License версии 2 или (на ваш выбор) любой новой
версией.
 
 

 
   Index 
 
 НАЗВАНИЕ 
 ОПИСАНИЕ 
 ИСПОЛЬЗОВАНИЕ 
 СМОТРИТЕ ТАКЖЕ 
 АВТОР 
 
 
 
 
 
 Поиск по тексту MAN-ов:  
 
 
 
 
 
 
 
 
 
 
 


 
 


 
 
 
 
 
Спонсоры:
 
 
 
 
 
 
 
 
Хостинг:
 

 

 


 
 
 
 Закладки на сайте 
 Проследить за страницей 
 
 
Created 1996-2021 by  Maxim Chirkov 
 Добавить ,  Поддержать ,  Вебмастеру 
 
 
 
 


 
 
 






end_of_comments
#---------------------------------------

unset filename